{"id":24200,"name":"Droidcon NYC 2015","description":"Round 2","locationName":"Metropolitan Pavilion","startDate":"08/27/2015 09:00AM","endDate":"08/28/2015 05:00PM","venues":[{"id":24300,"name":"TBA","description":null,"mapImageUrl":null,"events":[{"id":24355,"name":"Android Katas","description":"You will learn how to write your Android applications using test driven development (TDD). In TDD, tests lead our implementation. We start by writing a failing test and then code to make the test pass. Once we have a passing test, then we are free to refactor the system with high confidence that we didn't break other things. We continue this process until the feature is finished.<br />","category":null},{"id":24357,"name":"Android Studio: Beyond the Basics","description":"You probably already searched for &ldquo;top ten android studio tips&rdquo; and realized that the same stuff is repeated everywhere. How about going further? In this talk, we will take a look at features of Android Studio that will make your life easier. We will talk about lightning fast code navigation, obscure debugging techniques and a lot more. Let&rsquo;s go beyond the basics!","category":null},{"id":24375,"name":"Mobile Security: Death to passwords","description":"User authentication in mobile and web applications is a very common and integral use case. Implementing basic authentication is an easy solution for developers but comes with several pitfalls that impair user experience like (re-)entering passwords, the need to create a new unique password or even just the input of personal data on a flaky keyboard while registering a new account.<br /><br />In this talk the security flaws and UX implications of passwords will be discussed and Tim will highlight which different techniques exist that are able to offer a more mobile friendly flow. Highlighting authorization and authentication techniques like OAuth, OpenID Connect and even hardware features like Bluetooth Low Energy this talk will be interesting for anyone who's facing a situation where creating and storing user accounts matters.","category":null},{"id":24373,"name":"Material Design for Android","description":"Co-presented with Chris Banes and/or Nick Butcher.","category":null}]},{"id":24301,"name":"Midtown","description":null,"mapImageUrl":null,"events":[{"id":24353,"name":"Android Accessibility 101","description":"android:contentDescription=\"Making your application accessible is easier than ever. In this talk I will go through accessibility best practices, as well as case studies of various hurdles that app developers have overcome while trying to make their apps accessible. If you've never had a chance to look into accessibility, I hope this talk will convince you that it's more than just a feature to be backlogged.\"","category":"Develop","startDate":"08/27/2015 04:20PM","endDate":"08/27/2015 05:00PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":26450,"name":"Haley Rose Smith","profile":"Haley is an Android developer at Slack in San Francisco. Previously, she worked on the Android apps at Twitter and Rdio. She cares deeply about making the tech world a more inclusive place for marginalized people, and accessibility is an important part of that mission.","avatarKey":"http://static.sched.org/a6/301215/avatar.jpg.320x320px.jpg?10d","userCode":"796a","company":"Slack","twitter":null,"linkedIn":null,"website":"haley.zone","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24359,"name":"Better Code Through Lint and Checkstyle","description":"Nearly every Android developer has heard of the Lint and Checkstyle tools - however few use either to its full power, if at all. In addition to maintaining a consistent code style, we will see how to enforce architecture conventions and even prevent wrong usage of both internal and your own APIs.<br /><br />For example, you have a fancy BaseFragment which should be extended by all your Fragments, or you have a custom logger which should be used instead of android.util.Log. Both of these are perfect use cases for custom Lint checks. This session will show you how to configure Checkstyle and Lint to your liking, and how to use their APIs to create custom checks, as well as how to include both in your Gradle-based project.","category":"Develop","startDate":"08/28/2015 11:00AM","endDate":"08/28/2015 11:40AM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":24407,"name":"Marc Prengemann","profile":"Marc has been an Android developer for over three years - including work for major German publisher Süddeutsche Zeitung and for Facebook's Android Messenger team in Menlo Park. He is currently based in Berlin, working on the Wire messenger app and doing his Masters in Computer Science at the Technical University of Berlin. Marc has a Bachelor in Business Computer Science and in Mathematics. He previously spoke at the Droidcon Berlin 2015:<a href=\"http://droidcon.de/users/marc-prengemann\" target=\"_blank\">http://droidcon.de/users/marc-prengemann</a>","avatarKey":"http://static.sched.org/a6/2124592/avatar.jpg.320x320px.jpg?5c3","userCode":"913b","company":"Wire Swiss GmbH","twitter":null,"linkedIn":null,"website":"www.wire.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24363,"name":"Data binding in 2015: Reactive Data Binding and Firebase","description":null,"category":"Develop","startDate":"08/27/2015 05:10PM","endDate":"08/27/2015 05:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":24411,"name":"Mike McDonald","profile":"Mike is a Bay Area native and graduate of Rose-Hulman Institute of Technology, where he majored in Computer Engineering and Computer Science. In his free time, he enjoys backpacking, snowboarding, and developing embedded hardware.","avatarKey":"http://static.sched.org/a6/2124599/avatar.jpg.320x320px.jpg?b50","userCode":"0dcb","company":"Firebase/Google","twitter":null,"linkedIn":null,"website":"https://github.com/mcdonamp","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24377,"name":"Olivia's Talk","description":null,"category":null},{"id":25809,"name":"Bulletproof Android","description":"This session takes a look at Android security from a developer rather  than a hacker's perspective. Taken from the recently published book  \"Bulletproof Android,\" we look at how to protect your Android code, how  to use secure authentication in your app, how to communicate securely  with any backend server and how to safeguard that server against attack.  Throughout the class, we'll use real-world examples from the many  audits we've done over the years to show how other developers have tried  and sometimes failed to secure their code.","category":"Develop","startDate":"08/28/2015 05:00PM","endDate":"08/28/2015 05:40PM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":25855,"name":"Godfrey Nolan","profile":"Godfrey is founder and president of RIIS LLC, a mobile development firm in the Detroit Metro area. He is also author of \"Bulletproof Android\", \"Android Best Practices\", \"Decompiling Android\" and \"Decompiling Java.\" Godfrey has spoken at several AnDevcons as well as JavaOne, ASP-Connections, VSLive, Codemash, Code PaLOUsa, 1DevDay and many local Java and .Net user groups on a wide range of topics such as Continuous Integration, Executable Requirements and mobile security.","avatarKey":"http://static.sched.org/a6/2148001/avatar.jpg.320x320px.jpg?835","userCode":"b1dc","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":26600,"name":"Keynote: Android is the World Phone","description":"Android is the most popular operating system in the world and growing rapidly.<br /><br />Emerging markets are where most of the mobile growth over the next decade will occur, but there are too few solutions that specifically target (or even consider) their needs. Building solutions that serve&nbsp;<strong>all</strong>&nbsp;of your customers will become increasingly more important.<br /><br />We will explore emerging use cases, technical challenges, and social challenges you will encounter when serving these markets. You will walk away with guidelines to write globally inclusive applications in order to make a broader global impact.<br /><br />How will you impact the next billion?","category":"Develop","startDate":"08/27/2015 09:20AM","endDate":"08/27/2015 10:00AM","publicEvent":true,"rsvpCount":6,"speakers":[{"id":12815,"name":"Corey Latislaw","profile":"Corey Leigh Latislaw (<a href=\"http://coreylatislaw.com/\" target=\"_blank\">coreylatislaw.com</a>) is a Google Developer Expert (GDE) in Android who has written several high profile Android applications at companies large and small. By day she is rebooting a large hybrid enterprise app as a native Android app. At night she authors videos and books on Android programming, runs an Android consulting firm, and organizes the Philadelphia Google Developer Group. She is passionate about travel, local food, the outdoors, photography, and living in Philly.","avatarKey":"http://static.sched.org/a6/1411638/avatar.jpg.320x320px.jpg?6e8","userCode":"4b65","company":"Green Life Software Development","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25803,"name":"Android App Development for Newbies","description":"If you're attending the conference to start your Android journey, this  talk is for you. I'll introduce you to the tools and the basic  programming concepts. I'll create some simple Android apps and run them  on real phones. <br /> <br /> This isn't a hands-on session. But if you work on some examples during  the conference, I'll be available to help you get past any hurdles that  you encounter.<br /> <br /> Prerequisite: Reading knowledge of an object-oriented programming language such as Java.","category":"Develop","startDate":"08/27/2015 10:10AM","endDate":"08/27/2015 10:50AM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":26100,"name":"Barry Burd","profile":"Since 1980, Dr. Burd has been a professor in the Department of Mathematics and Computer Science at Drew University in Madison, New Jersey. He has lectured at conferences in the United States, Europe, Australia, and Asia. He is the author of several articles and books, including Java For Dummies, Android Application Development All-in-One For Dummies, and Java Programming for Android Developers For Dummies, all from Wiley Publishing, Inc.","avatarKey":"http://static.sched.org/a4/1355793/avatar.jpg.320x320px.jpg?cc1","userCode":"9237","company":"Drew University","twitter":null,"linkedIn":null,"website":"http://allmycode.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24379,"name":"Simple HTTP with Retrofit 2","description":"Retrofit has been simplifying HTTP calls for years and this new version is no different. In addition to fixing some long-standing annoyances, there are a handful of new features which make it more powerful than ever.<br /><br />This talk will focus on how the new APIs in Retrofit aid in making HTTP calls as simple as possible for your app. The integration with OkHttp and Okio APIs will be covered to ensure a full understanding of the HTTP stack. Common use-cases and design patterns through more advanced functionality will end the talk.<br /><br />No prior Retrofit, OkHttp, or Okio exposure needed. The content may quickly cover or skip some introductory aspects in order to allow focus on more actionable and useful content.","category":"Develop","startDate":"08/27/2015 11:50AM","endDate":"08/27/2015 12:30PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":5662,"name":"Jake Wharton","profile":"Jake Wharton is an Android developer at Square working on Square Cash. For the past 5 years he's been living with a severe allergy to boilerplate code and bad APIs. He speaks at conferences all around the world to educate more about this terrible plague that afflicts many developers.","avatarKey":"http://static.sched.org/a4/1356595/avatar.jpg.320x320px.jpg?ea8","userCode":"6d59","company":"Square","twitter":"JakeWharton","linkedIn":null,"website":"http://jakewharton.com","email":null,"phone":"","phoneticName":"","gPlus":"","nickname":"","coverKey":"884f2537-4abc-471f-ad16-6fb0e1c6494c_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":25827,"name":"What To Do About Fragments?","description":"What To Do About Fragments? Fragments are a regular subject of  controversy in the Android community. They're big and unwieldy,  difficult to test, and complicate a controller lifecycle that wasn't  particularly simple in the first place. In this talk, Bill will come  clean on why he continues to choose to emphasize fragments to beginners.","category":"Develop","startDate":"08/27/2015 01:30PM","endDate":"08/27/2015 02:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25869,"name":"Bill Phillips","profile":"Bill Phillips, a Fellow at Big Nerd Ranch, is coauthor of the best-selling Big Nerd Ranch Guide To Android Programming, now in its second edition. He has been writing Android applications and teaching Android fundamentals at Big Nerd Ranch for five years.","avatarKey":"http://static.sched.org/a6/2148013/avatar.jpg.320x320px.jpg?b11","userCode":"3811","company":"Big Nerd Ranch","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25821,"name":"Session: Building a Peer-to-Peer App with Couchbase Mobile","description":"With Couchbase Lite, you can enable peer-to-peer sync between two or  more devices. Bring your laptops and code along with William who will  show you how to build a peer-to-peer mobile photo-sharing app,  step-by-step, from scratch. You&rsquo;ll see how the core code for sending and  receiving photos is barely 100 lines of code and contains zero code  directly involved in network communication.","category":"Develop","startDate":"08/27/2015 02:20PM","endDate":"08/27/2015 03:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":5692,"name":"William Hoang","profile":"William Hoang is a Developer Advocate on the Mobile Engineering/Developer Experience team at Couchbase. His love for coffee and code has transcended him into the world of mobile while appreciating the offline in-person experiences.&nbsp;<br /><br />Prior, William worked on the Developer Relations team over at Twitter, BlackBerry, and Microsoft while also having been a Software Embedded GPS engineer at Research In Motion.&nbsp;William graduated from McGill University in Electrical Software Engineering<br /><br />Twitter: www.twitter.com/sweetiewill<br />LinkedIN: www.linkedin.com/in/williamhoang/","avatarKey":"http://static.sched.org/a4/1356574/avatar.jpg.320x320px.jpg?2fc","userCode":"dfa7","company":"CouchBase","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24374,"name":"Realm: Building a mobile database","description":"<p>SQLite was revolutionary when it launched in 2000 but developing mobile apps in 2015 is a very different beast than it was 15 years ago, and our notion of what a &ldquo;phone&rdquo; or &ldquo;app&rdquo; is has changed drastically.</p>\r\n<p>Realm has benefited from the last decade of innovation in order to create a new mobile-first database that is faster than SQLite and easier to use.</p>\r\n<p>This talk will take a deep dive into the underlying ideas and architecture behind Realm and lessons learned while building a new database API for Android.</p>","category":"Develop","startDate":"08/27/2015 03:30PM","endDate":"08/27/2015 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":24419,"name":"Christian Melchior","profile":"Christian's an Android developer focused on making Realm's Android SDK the default choice for developers. He has a strong love for clean, approachable code that's fast to boot.<br />\r\n<br />\r\nPrior to Realm, he got a MSc. in Computer Science and built award-winning apps at Trifork. When he's not coding, he enjoys wearing out hiking boots and trying to teach his two small children how to hunt dragons.","avatarKey":"http://static.sched.org/a6/2124585/avatar.jpg.320x320px.jpg?2cf","userCode":"5b5a","company":"Realm","twitter":null,"linkedIn":null,"website":"www.realm.io","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24361,"name":"Creating and Publishing Your Own Awesome Open Source Android Libraries","description":"Would you like to start contributing towards open source projects but don&rsquo;t know where to start? Or have your own project idea but don&rsquo;t even know where to begin? Based on my experience creating Awesome Material, an open source library based on my earlier Android Bootstrap project which helps developers incorporate Material Design, Bootstrap, and Font Awesome into their apps.<br /><br />This talk will walk you through with my real world examples: <br />* How to come up with an awesome open source project idea <br />* Creating a new Android Studio library project <br />* How to use it locally inside a sample app <br />* Considerations for creating your own API&rsquo;s <br />* Publishing to jCenter to make it super easy for people to access as a gradle import.","category":"Develop","startDate":"08/27/2015 06:00PM","endDate":"08/27/2015 06:40PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24409,"name":"Danielle Emma Vass","profile":"Danielle is a freelance mobile developer based in Bath, England with over four years experience specialising in Android. She’s been featured on the front page of Hacker News and the top of GitHub for an Android library she built, Android Bootstrap. She has also co-founded a community interest company, Teach Programming, which aims to inspire the next generation of computer scientists, especially girls, by making programming creative and therefore more fun and enjoyable. Finally, she has also accidentally become a lecturer at Bath College teaching Android mobile development to second year undergraduates.","avatarKey":"http://static.sched.org/a6/2124586/avatar.jpg.320x320px.jpg?9d1","userCode":"db9b","company":"","twitter":null,"linkedIn":null,"website":"www.de-velopment.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":26950,"name":"What’s New in Android UI Engineering","description":"A round-up of some of the latest new tools and frameworks that help you make amazing, beautiful, and very material Android UIs.","category":null,"startDate":"08/28/2015 09:20AM","endDate":"08/28/2015 10:00AM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":24418,"name":"Roman Nurik","profile":"<strong>Roman Nurik, Design Advocate<br /></strong>Roman Nurik is a designer and design advocate at Google NYC, working on Android as well as designer and developer tools. Since 2009, he's worked with hundreds of design and development teams on their Android UX, and shared a plethora of demos, libraries, articles and videos with the greater Android design and developer communities. He is also the creator of Android popular apps like the FORM Watchface for Android Wear, Muzei and DashClock and the former co-host of Android Design in Action.<br />","avatarKey":"http://static.sched.org/a6/2124576/avatar.jpg.320x320px.jpg?f52","userCode":"4c3f","company":"Google Inc.","twitter":null,"linkedIn":null,"website":"http://roman.nurik.net","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":27000,"name":"Nick Butcher","profile":"<strong>Nick Butcher, Android Design/Developer Advocate, Google<br /></strong>Nick is a Android Design/Developer Advocate in Google's London office where he helps designers and developers to create sublime mobile apps. He has been making Android apps for over 5 years and has worked with hundreds of companies to help them to make the most of the platform. Nick is a frequent contributor to the official android developers blog, conference speaker, host of Google Developers shows (Android Design in Action, Android Office Hours, DevBytes), co-author of the 'Android Design for Developers' Udacity course and shares pro-tips on Google+ and Github.&nbsp; Nick has worked on Google apps such as Google I/O and Android Device Manager. Recently Nick has been focused on helping designers and developers to understand and create beautiful material design apps.<br />","avatarKey":"http://static.sched.org/a6/2189621/avatar.jpg.320x320px.jpg?59f","userCode":"b7cb","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":27250,"name":"Chris Banes","profile":"<strong>Chris Banes, Developer Programs Engineer<br /></strong>Chris Banes is an engineer working on the Android Support Libraries at Google, most notably AppCompat, Design lib and Palette. He has worked on Android development for over 6 years, from open source libraries to media apps, social networks and more. Chris has recorded/authored a number of developer resources including video DevBytes, blog posts and a training class. Chris holds a degree in Computer Science from Aston University and currently resides in London.<br />","avatarKey":"http://static.sched.org/a6/2189618/avatar.jpg.320x320px.jpg?187","userCode":"9eec","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25800,"name":"@AnnotationProcessors (\"ByExample\")","description":"Annotations and Annotation Processors are all the rage in Android Development these days. There are annotations to help you:<br /> <br /> - Avoid the boilerplate of Parcelable or ContentProviders<br /> - Generate bindings for your views<br /> - Implementing deeplinking<br /> - Even find bugs in your code!<br /> <br /> This talk will showcase some existing annotations (like the  support-annotations library) and annotation processors (such as  butterknife, deeplinkdispatch, autoparcel). Afterwards, I&rsquo;ll show you  how to write your own.","category":"Develop","startDate":"08/28/2015 10:10AM","endDate":"08/28/2015 10:50AM","publicEvent":true,"rsvpCount":4,"speakers":[{"id":25850,"name":"Michael Evans","profile":"Android Lead at LivingSocial. Prior to LivingSocial, I worked at The Washington Post, and FINRA. I’ve been writing apps since Cupcake, co-organizer of DC Droids (the DC Android Meetup), and embarrassingly was one of those people walking around with Google Glass at one point.My mom also says I'm very smart.","avatarKey":"http://static.sched.org/a6/2145603/avatar.jpg.320x320px.jpg?0da","userCode":"9896","company":"LivingSocial","twitter":"@m_evans10","linkedIn":null,"website":"","email":null,"phone":"","phoneticName":"","gPlus":"","nickname":"","coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24364,"name":"Data Binding Techniques","description":"Timehop has been using the newly announced data binding features (https://developer.android.com/tools/data-binding/guide.html) since I/O 2015. I'm working on standardizing some best practices &amp; open source libraries for removing user interface logic from your activities and fragments. Quite excited about this topic!","category":"Develop","startDate":"08/28/2015 11:50AM","endDate":"08/28/2015 12:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24412,"name":"Jacob Tabak","profile":"Android developer at Timehop, open source contributor & maintainer","avatarKey":"http://static.sched.org/a6/2124579/avatar.jpg.320x320px.jpg?01c","userCode":"db68","company":"Timehop","twitter":null,"linkedIn":null,"website":"timehop.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25815,"name":"How the Main Thread works","description":"The main thread is where your app code runs by default. <br /> - What should you do on the main thread.<br /> - What should you NOT do on the main thread. <br /> - Handlers and Loopers<br /> - How the main thread affects your instrumentation tests.","category":"Develop","startDate":"08/28/2015 01:30PM","endDate":"08/28/2015 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5672,"name":"Michael Bailey","profile":"Michael Bailey, Engineering Director - Android, American Express&nbsp;<br /><br />Michael is the Engineering Director for the Android team responsible for American Express&rsquo; flagship consumer Android apps in the U.S. market. Development on these apps began in 2010.&nbsp;<br /><br />Since joining the company in 2008, Michael has worked on a number initiatives at American Express including analytics, enterprise content management, AmexLabs, iOS apps, international mobile applications, NFC payments, the U.S. homepage and the U.S. online card applications site.&nbsp;<br /><br />Michael holds a BS in Computer Science from Harvey Mudd College and an MS in Computer Science from the University of Southern California, where he specialized in computer security.&nbsp;<br /><br />Including the&nbsp;U.S.&nbsp;consumer&nbsp;apps that Michael works on, American Express has 8 Android apps in the&nbsp;U.S.&nbsp;Google&nbsp;Play Store (<a href=\"https://play.google.com/store/apps/developer?id=American%20Express\" target=\"_blank\">https://play.google.com/store/apps/developer?id=American%20Express</a>) and more in the&nbsp;international Play Stores.","avatarKey":"http://static.sched.org/a4/1375064/avatar.jpg.320x320px.jpg?672","userCode":"cd25","company":"American Express","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24385,"name":"Introduction to Functional Reactive Programming","description":"This talk will be an introduction to the ideas behind functional reactive programming and how you can move away from traditional synchronous state management with variables to asynchronous streams of data instead. You will learn how Rx (Reactive Extensions) Observables simplify concurrent code and&nbsp;let you write asynchronous, message based Android apps, in ways that are more elegant and a bit less error prone than traditional Android mechanisms.<br /><br />We will also take a look at some Higher-order functions such as map(), flatmap(), filter(), zip() and reduce() as well as some other Rx operators that enable you to write simple, expressive and concise code to process Observables and solve problems in many common Android scenarios. These powerful yet&nbsp;easy to use abstractions will let you write asynchronous code in a very straightforward, declarative fashion; making the task of writing great Android apps a lot easier.","category":"Develop","startDate":"08/28/2015 02:20PM","endDate":"08/28/2015 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":24427,"name":"Juan Gomez","profile":"Juan is a Senior Software Engineer at Netflix, where he’s in charge of the design and implementation of various aspects of the company's Android applications. He was previously an Android Engineer at Eventbrite and has been developing mobile solutions since the days of the PDA.<br />\r\n<br />\r\nHe is an active member of both the Python and Android communities, and has previously spoken about Mobile Development topics including Android on conferences like Droidcon, AnDevCon, PyCon US, Appsworld, Mobile+Web DevCon, among others.","avatarKey":"http://static.sched.org/a6/2124596/avatar.jpg.320x320px.jpg?be7","userCode":"8db4","company":"Netflix","twitter":null,"linkedIn":null,"website":"http://lanyrd.com/profile/juandg/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25806,"name":"Android Forestry at Square","description":"An Android app is a forest of trees: views, contexts, navigation, and  model. These hierarchical structures are distinct but often entangled,  making apps complex, hard to build, and harder to understand.<br /> <br /> This talk will focus on how Square has cleared the forest, teasing the  trees apart to build simple, testable, maintainable apps. It will cover  the techniques we use to work with each tree individually and to manage  their interactions to minimize complexity. Throughout, there will be  discussion of how these techniques relate to libraries like Dagger,  Mortar, Flow, Transitions, and others.","category":"Develop","startDate":"08/28/2015 03:30PM","endDate":"08/28/2015 04:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25853,"name":"Logan Johnson","profile":"Logan Johnson is a modernist Android developer at Square, working on Caviar and helping out wherever else he can.","avatarKey":"http://static.sched.org/a6/2147998/avatar.jpg.320x320px.jpg?d84","userCode":"f347","company":"Square","twitter":null,"linkedIn":null,"website":"http://squareup.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":29000,"name":"Meet the (Android) Press","description":"Hear what it's like to cover Android news from some of the best journalists out there. At this panel you'll get the inside scoop on what it's like day to day, learn the right way to pitch an Android journalist (even if you're an indie developer) and find out how they get all the secret info first (well, maybe not the secret info stuff).&nbsp;","category":"Business","startDate":"08/27/2015 03:00PM","endDate":"08/27/2015 03:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":28804,"name":"Florence Ion","profile":"Florence is a technology journalist based in the San Francisco Bay Area. She covers Android smartphones and tablets and its various forks for PCWorld and Greenbot. She's also written about a variety of other tech-related things for Ars Technica, Maximum PC, Mac|Life, PC Gamer, and Nintendo Power.","avatarKey":"http://static.sched.org/a6/2168233/avatar.jpg.320x320px.jpg?dd3","userCode":"0a43","company":"PCWorld/Greenbot","twitter":null,"linkedIn":null,"website":"http://www.greenbot.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":28806,"name":"Eric Zeman","profile":"","avatarKey":"","userCode":"4d68","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":28805,"name":"Andrew Cunningham","profile":"Andrew is the Senior Products Editor at Ars Technica, a position which fuels his love of anything with buttons and a screen. He began writing about IT, software, gadgets, and other topics for Ars in March of 2012. He received his bachelor’s degree in Classics from Kenyon College in Gambier, Ohio, and is a reformed IT professional with over five years of experience in the field. Andrew's work has appeared on Charge Shot!!! and AnandTech, and when off-duty he enjoys gaming, reading, good TV, bad movies, and cold IPAs. He also co-hosts a weekly book podcast called Overdue.","avatarKey":"//pbs.twimg.com/profile_images/529487765449101312/DyJt97VZ.jpeg","userCode":"785e","company":"Ars Technica","twitter":null,"linkedIn":null,"website":"http://arstechnica.com/author/andrew_cunningham/","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":28803,"name":"Michael Fisher","profile":"Michael Fisher has followed the world of mobile technology for over fifteen years as hobbyist, retailer, and reviewer. He currently reviews most of the shiny new mobile technology that passes through Pocketnow's labs, fulfilling a lifelong dream of playing with toys for a living. (While Pocketnow covers all mobile platforms, Michael spends most of his time with Android devices.) <br />\r\n<br />\r\nHe loves talking about smartphones, smart watches, tablets, interesting apps and weird accessories ... in about that order.","avatarKey":"http://static.sched.org/a6/2168228/avatar.jpg.320x320px.jpg?fa7","userCode":"fdc2","company":"Pocketnow","twitter":null,"linkedIn":null,"website":"http://pocketnow.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":25871,"name":"Liam Spradlin","profile":"I'm Liam Spradlin, a visual designer working on the web, iOS, and Android. In the past few years I've worked in both agency and freelance contexts with clients including GE Appliance, the National MS Society, and a number of independent developers with apps like Nova Launcher, AllCast, and Today Calendar, creating compelling interfaces, experiences, print layouts, and visual assets. My approach with any design, whether it's a brand new product yet to be shaped, or an existing one with millions of users, is to figure out the essentials - what does it do? What does the audience expect? How can we best facilitate the former and satisfy the latter? I like to explore areas where designs can delight their audiences in invisible ways, and I think there are tons of these opportunities in modern design, especially on mobile devices. My main hobby is also my work - whether it's typography, interface, or illustration, most of my free time is spent designing. Outside of that, I'm a freelance photographer (most recently shooting the Kentucky Derby for Churchill Downs), a writer, and - occasionally - a glass blower.","avatarKey":"http://static.sched.org/a6/2148006/avatar.jpg.320x320px.jpg?c5e","userCode":"5d42","company":"touchlab","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25828,"name":"Be a Good Citizen: Develop Maintainable Apps","description":"The number of Android Libraries available is enormous and that number continues to grow day-by-day! But should you try to incorporate them all into your application? Do you really need to use EventBus, RxJava, and Custom Observables? How many different image libraries have you included? Hopefully you get the point, great Android apps only include what's needed to achieve the goals of the product, not enhance the resume of the developer.<br /><br />In this talk learn four components essential to developing maintainable Android applications. What criteria should you use when choosing a library to include in your project? What simple changes can you adopt to improve your domain design? What tools are available to assist you in delivering high quality code? What can you start doing today to make your app more maintainable?&nbsp; Walk away with the tools you need to be a good Android citizen!<br /><br />","category":"Develop","startDate":"08/28/2015 04:20PM","endDate":"08/28/2015 05:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25870,"name":"Annyce Davis","profile":"Annyce works as a Senior Software Engineer at The Washington Post. She has spent the past 4 years developing applications for the Android ecosystem across multiple form factors. She loves mobile development but enjoys the challenges that come with building database-backed web applications. She is active in the Washington, DC tech scene and assists with running a local meetup focused on innovation in the media industry.","avatarKey":"http://static.sched.org/a6/2147992/avatar.jpg.320x320px.jpg?459","userCode":"f1aa","company":"The Washington Post","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24360,"name":"Building First Class Sdks: A Fabric Case Study","description":"The Android app ecosystem is an international phenomenon. Developers need better tools now, more than ever, and the number of third-party SDKs is also growing to meet the developer's needs. Unfortunately, many of these SDKs are poorly developed and extremely difficult to use. In fact, at Twitter on the Fabric team, we've detected a significant percentage of issues caused by third-party SDKs.<br /><br />Fabric, formerly Crashlytics, is well-known for its focus on SDK quality, and has been deployed on billions of devices. In this session, attendees will learn the skills to develop and distribute SDKs for Android. We&rsquo;ll cover an overview of Fabric, deep dive into technical decisions we made, and present the learnings on developing an SDK for stability, testability, performance, overall footprint size, and, most importantly, exceptional ease of implementation. Over the course of the session, we'll develop a simple but well-architected SDK and uncover and explain many of the challenges we encountered when building SDKs at Twitter. Topics include device feature detection, supporting multiple application types (from Widgets to Services to Foreground GUI applications), API design, deploying artifacts, and coding patterns to support developer customization. We'll conclude with advanced topics, from less-known but very useful tricks to minimizing impact on application start-up time to reducing memory footprint and persistent CPU use.<br />","category":"Develop","startDate":"08/27/2015 11:00AM","endDate":"08/27/2015 11:40AM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":24408,"name":"Ty Smith","profile":"Ty Smith is a Sr. Software Engineer building the Fabric SDKs at Twitter. Ty is a regular community contributor, organizing events like Meatup and speaking at AnDevCon, Droidcon, and many other conferences around the world. He is an organizer for the San Francisco Android Meetup group and teaches Android at Missionbit. Prior to Twitter, Ty worked on the Evernote App and SDK, cofounded Recapp, a social sports news startup, lead the engineering effort on Powow Text Messaging on Android which was acquired by Sprint, and built Zagat for Android which was acquired by Google. Ty holds a B.S. in Software Engineering from the University of Texas. He lives in San Francisco.","avatarKey":"http://static.sched.org/a6/2124587/avatar.jpg.320x320px.jpg?6b9","userCode":"3855","company":"Twitter","twitter":null,"linkedIn":null,"website":"tysmith.me","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":29001,"name":"Do Something (Anything) About Diversity in Tech Now.","description":"We're not going to spend much time talking about tech's diversity issues, if you're not yet aware of the problem there are lots of places for you to go educate yourself on it (and seriously, you should). This&nbsp;panel&nbsp;is a group of awesome folks who have made decisions to&nbsp;<strong>do&nbsp;</strong>things within their control to try to affect the situation. They're going to tell their stories briefly and then we're going to turn the attention away form the stage and to the audience.&nbsp;<br /><br />Our goal in this session is to help empower&nbsp;<strong>you&nbsp;</strong>to start doing something, tiny, huge or in-between, today.","category":"Business","startDate":"08/28/2015 03:00PM","endDate":"08/28/2015 03:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":12811,"name":"Jeff Namnum","profile":"Jeff Namnum is a partner at Touch Lab, the premier Android-only development shop based in NYC. Previously he was the principal at NoFancyName working with startups on issues of growth &amp; marketing. He's organized multiple conferences on marketing &amp; social media, speaks frequently &amp; has advised a number of startups. Jeff also loves long walks in the rain &amp; is allergic to bullshit.","avatarKey":"http://static.sched.org/a4/1382581/avatar.jpg.320x320px.jpg?efd","userCode":"5c3f","company":"Touch Lab Inc","twitter":null,"linkedIn":null,"website":"http://touchlab.co","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":28808,"name":"Christina Morillo","profile":"Christina is an experienced Identity and Access Management professional with expertise in IAM architecture, access governance, global deployments and automation. With nearly two decades of experience, she has also managed high-level technology initiatives for financial organizations like Fitch Ratings, Swiss Re and Alliance Bernstein.  When she is not focusing on protecting these firms  from both internal & external threats, she is very active in the NYC tech community.<br />\r\n<br />\r\nTalk to her about:<br />\r\n- Identity & Access Management/InfoSec<br />\r\n- Women in Tech @wocintechchat <br />\r\n- FinTech <br />\r\n- The CodeNewbie community","avatarKey":"http://static.sched.org/a6/2200725/avatar.jpg.320x320px.jpg?66f","userCode":"5801","company":"@wocintechchat","twitter":null,"linkedIn":null,"website":"christina.tech","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":28807,"name":"Willie Jackson","profile":"I publish a(n awesome) magazine for black men called Abernathy. I'm a technologist by trade, and I like gelato.","avatarKey":"https://graph.facebook.com/v2.0/10106581303372133/picture?width=400","userCode":"fd78","company":"Abernathy Magazine","twitter":null,"linkedIn":null,"website":"https://abernathymagazine.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":24402,"name":"Chiu-Ki Chan","profile":"Chiu-Ki is an Android developer with a passion in speaking and teaching. She has spoken at numerous conferences all over the world, and has been recognized as a Google Developer Expert for her extensive knowledge in Android. She runs her own mobile development company, producing delightful apps such as \"Monkey Write\" for learning Chinese writing, \"Heart Collage\" for snapping photos to stitch into a heart, and \"Fit Cat\" which gets more athletic the more you walk.","avatarKey":"http://static.sched.org/a5/1933393/avatar.jpg.320x320px.jpg?658","userCode":"e648","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":14000,"name":"Tom O'Connell","profile":"Tom is the Program Director at C/I, a nonprofit dedicated to inspiring the next generation of technology leaders from underserved communities. At C/I, Tom manages after school programs at 13 high schools in New York, organizes summits for students to work on projects with volunteer tech professionals, and places students in paid internships.<br /><br />Tom is a Teach For America alumnus who taught high school science and coordinated non-profit partnerships in Houston and Brooklyn. He holds a B.S. from Cornell University and an M.Ed from the University of St. Thomas.","avatarKey":"http://static.sched.org/a4/1411327/avatar.jpg.320x320px.jpg?aaa","userCode":"4346","company":"C/I","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":26900,"name":"UES","description":null,"mapImageUrl":null,"events":[{"id":24370,"name":"Genymotion for Application testing and Continuous Integration","description":"Targeted audience : Intermediate Android developers and CI administrators.<br /><br />How the new Genymotion command line tool and the Gradle plugin can help you run your automated tests? Integrate your virtual devices into your CI server, create the devices automatically, start them, run your tests, grab the logs then trash everything: every test should be done on a brand new device!<br /><br />During this session, we will show you how to define your devices through the command line tool or in your Gradle script, when to run your test scripts, how to grab your logs and clean the place. We will also explain how to integrate those features into your preferred CI tool and make the best of it.<br /><br />Then close your eyes, press the button, relax, the robots will do the work for","category":"Develop","startDate":"08/27/2015 11:50AM","endDate":"08/27/2015 12:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24416,"name":"Sylvain Galand","profile":"Sylvain is an Android developer @Genymobile Paris. He gave some talks, wrote some stuff, open-sourced few lines of codes and worked on Android since Day 1. He loves beer, Genymotion and sharks.<br />+SylvainGaland @sylvaingaland<br />Droidcon Paris :&nbsp;<a href=\"http://www.youtube.com/watch?v=EEUyO7hqJLU\" target=\"_blank\">http://www.youtube.com/watch?v=EEUyO7hqJLU</a><br /><br />Antonin is an Android expert at Genymobile, in France. Formerly a design and conception engineer, he is now the Genymotion Scrum Master. During his spare time, he is also Event Organizer at Paris Android User Group, writes technical articles, gives talks, develops Android applications, and tries to conquer the world.<br />+AntoninFouques @cmoatoto<br />Paris Android User Group : https://www.youtube.com/watch?v=S8S3MB9Xtkk","avatarKey":"http://static.sched.org/a6/2124593/avatar.jpg.320x320px.jpg?5e3","userCode":"9e9e","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24367,"name":"Fast deterministic screenshot tests for Android","description":"I'll talk about how we at Facebook generate fast deterministic screenshots for Android views, with particular focus on how we do this for the hundreds of different configurations of Android feed stories.<br /><br />I'll talk about how we use this both for iterating fast on user interfaces, and for catching regressions.<br /><br />We'll also open source our screenshot tools. This will be similar to what Facebook has already open-sourced for iOS [1].<br /><br />[1] https://github.com/facebook/ios-snapshot-test-case","category":"Develop","startDate":"08/27/2015 04:20PM","endDate":"08/27/2015 05:00PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":24414,"name":"Arnold Noronha","profile":"I work on Android Newsfeed at Facebook NYC, in particular with test infrastructure. Previously I have worked at Google New York, and at a startup in Palo Alto.","avatarKey":"http://static.sched.org/a6/2124590/avatar.jpg.320x320px.jpg?4ec","userCode":"d917","company":"Facebook","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24378,"name":"Detect all memory leaks with LeakCanary!","description":"In just a few few weeks, we reduced by 94% the OutOfMemoryError crashes in the Square Register Android app. We built http://squ.re/leakcanary to automatically detect memory leaks and make it very easy to fix them. This talk will cover the principles as well as the underlying implementation details. We'll dig into a few interesting examples and lessons learned.","category":"Develop","startDate":"08/27/2015 10:10AM","endDate":"08/27/2015 10:50AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24423,"name":"Pierre-Yves Ricau","profile":"Pierre-Yves Ricau is an Android Baker at Square who enjoys good wine and low entropy code.&nbsp;<br />@Piwai | cash.me/$hit","avatarKey":"http://static.sched.org/a6/2124559/avatar.jpg.320x320px.jpg?480","userCode":"715d","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24352,"name":"Advanced Android Espresso","description":"Do you test? It&rsquo;s okay if you don&rsquo;t - historically the tools had not been stellar. But they have gotten much better, and I am going to show you my favorite, instrumentation testing with Espresso. <br /><br /> In this talk you will learn: <br />* The basic structure of an Espresso test (Matcher, ViewAction, ViewAssertion) <br />* Combining matchers such as withParent, isAssignableFrom to pinpoint your view <br />* onData and RecyclerViewActions to test ListView and RecyclerView <br />* Custom ViewAction and ViewAssertion <br />* Using Dagger and Mockito to write repeatable tests <br /><br /> By the end of the talk you will be itching to write some tests yourself!","category":"Develop","startDate":"08/27/2015 11:00AM","endDate":"08/27/2015 11:40AM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":24402,"name":"Chiu-Ki Chan","profile":"Chiu-Ki is an Android developer with a passion in speaking and teaching. She has spoken at numerous conferences all over the world, and has been recognized as a Google Developer Expert for her extensive knowledge in Android. She runs her own mobile development company, producing delightful apps such as \"Monkey Write\" for learning Chinese writing, \"Heart Collage\" for snapping photos to stitch into a heart, and \"Fit Cat\" which gets more athletic the more you walk.","avatarKey":"http://static.sched.org/a5/1933393/avatar.jpg.320x320px.jpg?658","userCode":"e648","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24380,"name":"Speed up your app","description":"With a great variety of tools for optimizing your Android apps, it's easy to get lost and find it hard to even start working on the problem. In this talk, I'll cover how to approach a performance issue by picking the right tool for the job, analyzing the data and track down the culprit. I'll show case studies using Systrace, Traceview, Hierarchy Viewer, Allocation Tracker, Eclipse MAT and others, demonstrating variety of problems that many apps suffer from, and how to solve them.<br /><br />I'll also cover how to find problems with the app's layouts, which directly affects its performance: <br />- Overdraw - what is it, how the framework helps to avoid it and what can we do to reduce it. <br />- Bad behaving layouts - Find them and reconstruct them to bring the same result with less performance hit. <br /> - Custom views - how can they hurt us and what can we do about that.<br /><br />Besides tracking existing problems, we'll talk about how to write better performing apps in the first place: <br />- Hardware acceleration is not a silver bullet. In order maximize its potential, we need to know how to properly leverage hardware acceleration for every app's unique UI. <br /> - Bitmap hacks to optimize the use of bitmaps in the app. Using an image loading library is not always enough, and there could be a better way to optimize the bitmap usage for your app. <br /> - General and less popular tips that many don't know about and should.<br /><br />I'll share some of my \"war stories\" in the talk, to give some real-life examples, and showcase how can anyone start optimizing their apps the next day.","category":"Develop","startDate":"08/27/2015 01:30PM","endDate":"08/27/2015 02:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24424,"name":"Udi Cohen","profile":"With a great passion for problem solving, I've been a software engineer for over 14 years, where I worked with Java, C++, Python and many other technologies.   In the past 5 years, I've been focusing on Android and experienced every aspect of it - from custom views to AOSP development. I love creating great UI with smooth animations, optimizing apps/platform performance and delivering a great user experience.  I gave several talks over the years about performance optimization and Android in general. I write about Android and other geeky stuff on my blog (http://blog.udinic.com) and I open sourced most of my small projects (https://github.com/Udinic), to help the Android community with some of the least understood parts in the platform.  Today I'm the head of Android development for Samsung NYC. Before that, I was the lead Android engineer for Any.do (http://any.do), where I built Any.do's Android client and the Calendar app - \"Cal\".","avatarKey":"http://static.sched.org/a6/2124581/avatar.jpg.320x320px.jpg?d06","userCode":"3c89","company":"","twitter":null,"linkedIn":null,"website":"http://www.udinic.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24351,"name":"A Pirate’s Guidelines for Android","description":"Fragments suck. State is hard. Android is hostile. How can you write a crashfree, bug free app on such a buggy, fragmented OS? In the spirit of Jack Sparrow, I&rsquo;ve come up with some guidelines for making Android development less of a headache. Talk would basically be about how we&rsquo;ve adapted and used each of these in the Electric Objects companion app.<br /><br />- There is a one to one correspondence between a wireframe screen and an Activity. <br />- Every Activity has it's own layout file. <br />- Reusable View code belongs in a View class. <br />- Fragments are not simple. Don't use fragments. <br />- Embrace state machines.  <br />- Corollary: Every Activity is a State Machine. <br />- Override on configuration changed at your own peril (aka never) <br />- Retain nothing but state (and hardware adapters)","category":"Develop","startDate":"08/27/2015 02:20PM","endDate":"08/27/2015 03:00PM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":24401,"name":"Lisa Neigut","profile":"Lisa Neigut work at Electric Objects, hacking Android into a form that is artfully engineered.   One of the first full time Android team members at Etsy, she has a few years experience of building beautiful apps, deep linking things, and talking about Gradle. <br />\r\n<br />\r\nShe currently works as the Android Engineer at Electric Objects.","avatarKey":"http://static.sched.org/a6/2124578/avatar.jpg.320x320px.jpg?0ab","userCode":"6e94","company":"Electric Objects","twitter":null,"linkedIn":null,"website":"www.electricobjects.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24381,"name":"Successful Continuous Integration on Android","description":"While \"Build -&gt; Generate Signed APK\" in Android Studio can get an app onto the Play Store, it is probably not a solution that scales well. Manual processes like clicking export are prone to human error, requiring developers to copy keys from machine to machine, share secret passwords with potentially untrustworthy individuals, and remember to run tests before pushing code. Fortunately, there's an answer to these problems with Continuous Integration (CI) tools, like Jenkins. In this session, Stephen will show you how to set up a cloud-hosted Jenkins instance, hook it up to your source code, and get building. To wrap things up, Stephen will share some tips and tricks for managing things like versionName and versionCode, deploying to the Play Store, saving APK's and more.","category":"Develop","startDate":"08/27/2015 03:30PM","endDate":"08/27/2015 04:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":24425,"name":"Stephen D'Amico","profile":"Stephen is an Android Engineer at SeatGeek in NYC where he spends his time building the optimal mobile event ticketing experience. He began developing for the Android platform in 2011 and has never looked back, adapting to using tools like RxJava, Dagger, Retrofit and Sixpack to make his life a little more sane. Prior to SeatGeek, Stephen was at ESPN building their suite of Android applications including the #1 sports app in the Play Store, ESPN (formerly ScoreCenter/SportsCenter). Stephen hails from the great state of Wisconsin, enjoys brewing (and drinking) beer, gaming, snowboarding, golfing and tinkering with embedded systems. Stephen holds a BSE in Electrical and Computer Engineering from the University of Iowa.","avatarKey":"http://static.sched.org/a6/2124595/avatar.jpg.320x320px.jpg?972","userCode":"bfca","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25820,"name":"Reflection No Reflection - Boosting performance on Android by bypassing Reflection API","description":"On Android, many applications rely on the Java Reflection API. For  instance, all data driven apps get data from the network, save data in  your local cache files / databases. And most of the libraries used to  simplify those tasks will use reflection in their core. <br /> <br /> Unfortunately, Reflection is slow on Android due to limitations of  Dalvik and Art. The usual workaround is to write annotation processors  and replace Reflection by generated code. But, it comes with a price :  all the robust and mature libs from Java can't be reused and must be  rewritten, often in a degraded, simpler version. And the annotation  processor API is quite tricky, leaving this work to a handful of expert  coders.<br /> <br /> In this talk, we will demonstrate a new approach using the Reflection No  Reflection (RNЯ). This new technology provides a much faster access to  reflection data, while maintaining compatibility with the Reflection  API. Using this technique, any library can swap out use of the  Reflection API with this interface-compatible implementation to achieve  greater performance.<br /> <br /> It also comes with an additional benefit : if you create annotation  processors based libs, you can now get rid of annotation processing API  when writing an annotation processor : you will be able to use  reflection of classes...Yes, before they are even compiled !","category":"Develop","startDate":"08/27/2015 05:10PM","endDate":"08/27/2015 05:50PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25864,"name":"Stéphane Nicolas","profile":"With around 20 years of experience of Java programming, St&eacute;phane has been teaching programming and software design for more than seven years to scholars and young professionals. He has realized several Android applications in a professional contexts for different companies: Deezer (France, online music company), OCTO (France, Android consulting) and now Groupon (Canada/US, online shopping) as a Senior Android developer. He focuses on topics like dependency injection, asynchronous networking, testability, robustness and design, continuous integration, and bringing quality analysis to Android.<br /><br />He is passionate of contributing to open-source libraries, and participates to many of them on GitHub: RoboSpice, RoboGuice, BoundBox, maven-android-plugin, Quality Analysis Tools for Android, Mimic, AfterBurner, RoboDemo, etc. He also actively contributes to the Android community on Stack Over Flow and by participating to international conferences (DroidCons: Paris, London, Amsterdam and Devoxx Paris).","avatarKey":"http://static.sched.org/a6/2147990/avatar.jpg.320x320px.jpg?c72","userCode":"994f","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24366,"name":"Gradle: From User to Addict","description":"Default Gradle build scripts produced by Android IDEs are deceptively simple. However, this simplicity is often misleading as Gradle scripts have the potential for much more intricate behaviors than XML property file build systems. This complexity gap between the simple and the possible often causes roadblocks when an Android developer actually needs to do anything unique during a build. This class will help bridge that complexity gap by diving under the hood to explore how both simple and complicated build scripts actually work.<br /><br />You will learn when and where lines of your build scripts are actually getting executed and what conditions prevent them from changing the state of your build. You'll also learn how you can create reusable code in a multi-app build environment. Finally, you'll hear important tips to make sure your Android Gradle scripts work well within the plugin ecosystem. All these lessons come straight from Jake's experiences developing the Crashlytics plugin for Gradle, which has been used in production by top Android app developers for almost two years. We'll cover advanced Gradle topics, but introduce them in a way that is accessible to newer users.","category":"Develop","startDate":"08/28/2015 11:00AM","endDate":"08/28/2015 11:40AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24413,"name":"Jake Ouellette","profile":"Senior Software Engineer at Twitter, focused on developing testable software systems to solve complex problems. Ships software by communicating with customers, prioritizing in teams, and building things iteratively.","avatarKey":"http://static.sched.org/a6/2124583/avatar.jpg.320x320px.jpg?d00","userCode":"448c","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24350,"name":"10 ways to Improve Your Android App Performance","description":"As a Developer Advocate at Google, I am exposed to a large number of various Android apps. I want to bring together several rules of thumb to make your Android app better, while avoiding the common pitfalls.<br /><br />* Deprecated APIs <br />* System/OS abuse <br />* Memory Leaks <br />* Consistent App structure <br />* Optimizations <br />* Method count <br />* 3rd party libs","category":"Develop","startDate":"08/28/2015 11:50AM","endDate":"08/28/2015 12:30PM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":24400,"name":"Boris Farber","profile":"Android and JVM Programming Expert. I enjoy the challenges of design, languages and frameworks. I aim for simple solutions to complex problems.As a Developer Advocate I help promote Android APIs. I act as a bridge between internal teams and developers building apps and solutions on top of Android APIs.- Consult about Android App structure and effective practices- Present in major conferences about Android framework- Solve Android issues around runtime, framework and JNI","avatarKey":"http://static.sched.org/a6/2124591/avatar.jpg.320x320px.jpg?c54","userCode":"43ba","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25805,"name":"Android Engineering for Scale","description":"The story of scaling Android Engineering at SoundCloud. We grew our team  from two developers to 8 in little more than a year. This talk presents  the processes and technologies that helped us as well as things we&rsquo;re  striving to get right.<br /> <br /> Some things needed to evolve: the app architecture, branching strategy, code review policy and release process.<br /> <br /> Other values supported us: unit/acceptance testing, pairing, continuous  integration, end-to-end development and reactive programming.<br /> <br /> This would be a revised an updated version of a talk originally  presented at Droidcon London:  https://speakerdeck.com/jdamcd/android-engineering-for-scale","category":"Develop","startDate":"08/28/2015 01:30PM","endDate":"08/28/2015 02:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25852,"name":"Jamie McDonald","profile":"Jamie is a Mobile Engineer at SoundCloud, where he works on the Android app and mobile API. He has been focusing on the Android platform for over 5 years and has previously worked at The Guardian and Novoda.","avatarKey":"http://static.sched.org/a6/2147994/avatar.jpg.320x320px.jpg?f58","userCode":"6114","company":"SoundCloud","twitter":null,"linkedIn":null,"website":"jdam.cd","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25810,"name":"\"Buy a plunger before you need a plunger\" - DevOps tools for Android","description":"It's important to have support tools in place before you launch your  application.  However, it's sometimes the last thing that is considered  (gotta build those features!).<br /> <br /> Knowing which tools are the right ones for you, how they compare against  each other, and which give the most value can be difficult.<br /> <br /> During this talk we will review many tools that range from crash  reporting, remote log management, analytic tracking, beta distribution,  continuous integration, and much more.","category":"Develop","startDate":"08/28/2015 04:20PM","endDate":"08/28/2015 05:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":5670,"name":"Brent Watson","profile":"Brent Watson is an Sr. Android Engineer at Percolate Industries Inc, in NYC. Brent writes applications used by major brands such as GE, AirBnB, VW, Visa, Converse, Braun, Ford, Guinness, and many others.  Pastimes include kung fu movies, cobbling shoes, writing & reviewing books, and spending time with his family.  You can find him on twitter @brent_watson, and online at brentwatson.com","avatarKey":"http://static.sched.org/a4/1356590/avatar.jpg.320x320px.jpg?b95","userCode":"4125","company":"Percolate","twitter":null,"linkedIn":null,"website":"brentwatson.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25804,"name":"Android Development Like a Pro","description":"The Android Sdk has changed much since its first version.  Every new version comes with many new APIs. However, there is no perfect  API, some do too much under the hood, others couple your classes to the  context, others have more lifecycle events than you have years in your  life.<br /><br /> The talk will show how to make your app scalable, your code clean, your  performance optimized and your UI neat. The talk will show in a  pragmatic way the pros and cons of using certain Android APIs,  strategies and libraries. It will touch on Fragments, Loaders,  AsyncTasks, OOP patterns (mvp vs mvvm vs viper) and styling.<br /><br /> This talk is a compendium of my experience in large code bases since I started to work in Android in 2009.","category":"Develop","startDate":"08/27/2015 06:00PM","endDate":"08/27/2015 06:40PM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":25851,"name":"Israel Ferrer Camacho","profile":"Israel Ferrer Camacho is an Android engineer working at Twitter. Passionate about Android, object oriented design principles, testing and agile methodologies. Ex @lookout and @feverup. Android developer since 2009. Israel is the co-founder of Barcelona GDG and is also co-founder of @bubiloop and @androides.&nbsp;<br />Twitter : @rallat","avatarKey":"http://static.sched.org/a6/2148009/avatar.jpg.320x320px.jpg?a5b","userCode":"cc31","company":"Twitter","twitter":null,"linkedIn":null,"website":"http://israelferrer.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25807,"name":"Android, May I?","description":"The upcoming Android M release changes the way permissions are granted  and handled in the system, with the goal of a more fluid experience and  more refined user control.  While this is a good thing, it also puts a  larger burden on app developers creating new apps as well as authors of  legacy apps.  This talk will take a look at the basics of permissions,  the impact to the user and the impact to you, the developer.","category":"Develop","startDate":"08/28/2015 10:10AM","endDate":"08/28/2015 10:50AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25854,"name":"Larry Schiefer","profile":"Larry Schiefer is the CTO and co-founder of HIQES LLC, creators of mobile applications, mobile platforms and embedded system software. Larry is a recognized Google Developer Expert (GDE) for Android, has spoken several times at AnDevCon, and has provided face to face and recorded developer training on Android's internals, app development and security.","avatarKey":"http://static.sched.org/a6/2147996/avatar.jpg.320x320px.jpg?f3a","userCode":"6dd7","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":28350,"name":"Building a Node.js Backend in the Cloud for Android Apps","description":"The Cloud is the perfect extension for mobile applications. Mobile apps don&rsquo;t exist in a vacuum, you never know if you&rsquo;ll have 10 or 100,000 users, and sooner or later you&rsquo;ll need to save user data in the cloud, perform operations server-side for enhanced scalability, or monitor data feeds to push notifications to your mobile users. Microsoft Azure provides the best infrastructure for mobile developers across all platforms thanks to cross-platform storage, authentication and push notification services, all residing in the cloud. This session explores how you can build cloud-enabled cross-platform applications for iOS, Android and Windows 10 and Azure App Services for mobile, with demos focusing on the Android Java developer. You&rsquo;ll learn how to authenticate users via Microsoft, Google, Facebook or Twitter credentials, store data remotely in NoSQL tables and blob storage, and even how to send push notifications to all vendor platforms (including GCM), all through live Android demos. Whether you&rsquo;re a weekend warrior building consumer apps, a savvy entrepreneur building the next revolution, or a corporate mobile developer building apps for the enterprise, the cloud is the perfect companion for your mobile apps. Come learn how easy it is to harness its power.","category":"Develop","startDate":"08/28/2015 02:20PM","endDate":"08/28/2015 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28201,"name":"Nick Landry","profile":"Nick Landry (@ActiveNick) is a mobility pioneer and former entrepreneur specializing in cross-platform mobile app development for Windows, iOS and Android devices. Nick works at Microsoft as a Senior Technical Evangelist in the New York Metro area. He spent most his career in IT consulting, software and services companies across various technical and business roles, designing, building, managing and selling innovative software products and solutions for the world&rsquo;s top brands and Fortune 500 companies.<br />Known for his dynamic and engaging style, he is a frequent speaker at major software development conferences worldwide, was a 10-year Microsoft MVP awarded on Windows Phone Development, and a Nokia Developer Ambassador &amp; Champion. With over 23 years of professional experience, Nick is a certified developer and software architect by trade and specializes in Cross-Platform Mobility, GIS, Cloud, IoT and Mobile Game Development. He is an active blogger, occasional author, avid gamer, loving husband and proud father.","avatarKey":"http://static.sched.org/a6/2199347/avatar.jpg.320x320px.jpg?fc6","userCode":"23d9","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24383,"name":"Whoa, Views can do that? WindowManager ideas and tricks!","description":"Do you really want to amaze your friends and delight your users? Try adding a View directly to the WindowManager. Pretty cool stuff, right? Now, run your UI in a sticky Service. Maybe you are on your way to making the next floating web browser, huh?<br /><br />Not so fast. This fun technique has some unexpected pitfalls. What happens when you want to translate your Views in the WindowManager? What happens when you want to apply some alpha animations pre-Lollipop? What about scaling? While building these cool features into IFTTT's DO Button app, I quickly found some unexpected behaviors.<br /><br />This talk will cover first the basics of making this uniquely Android experience and then drill into the tactics for maneuvering the quirks of the trade. I will explain the strategies I used in maintaining consistent behavior from API level 15 (4.0.4) to 21 (5.0) and how you can save your sanity while still impressing your friends with these \"floating\" Views.","category":"Develop","startDate":"08/28/2015 03:30PM","endDate":"08/28/2015 04:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":24426,"name":"Eric Cochran","profile":"I strive to build delightful experiences for users' most personal devices.  At IFTTT, I have the pleasure of working with a broad range of Android APIs and features across four apps.   We love to automate all the things, and Android has been no small part of that dream.  I love constantly learning and building new techniques, and Android provides both a great platform and an excellent community for devs.","avatarKey":"http://static.sched.org/a6/2124582/avatar.jpg.320x320px.jpg?7b2","userCode":"dc65","company":"IFTTT","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":26750,"name":"UWS","description":null,"mapImageUrl":null,"events":[{"id":25812,"name":"Fresco: How Facebook saved a century a day","description":"One of the hardest things about with Android is working with images. <br /> <br /> In their uncompressed form, they take up vast quantities of memory. Even  the best-written apps routinely suffer crashes and slowdowns due to the  demands of images and animations.<br /> <br /> This talk will show you how Facebook cut its image load time by two  thirds, while reducing crashes and improving scroll speed. It will also  cover how you can use these same techniques with the new open-source  library, Fresco (<a href=\"http://frescolib.org\" target=\"_blank\">http://frescolib.org</a>)<br /> <br /> I will cover some poorly documented features in the Android SDK and NDK  that Fresco takes advantage of, including some Android source code  walkthroughs.","category":"Develop","startDate":"08/27/2015 10:10AM","endDate":"08/27/2015 10:50AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25857,"name":"Tyrone Nicholas","profile":"","avatarKey":"https://graph.facebook.com/v2.0/10153480472009420/picture?width=400","userCode":"2bc7","company":"Facebook","twitter":null,"linkedIn":null,"website":"frescolib.org","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25814,"name":"Have you seen Cloud Spin?","description":"Have you seen Cloud Spin?  It's a demo that Google Cloud Developer  Advocates (Ray Tsang, Bret McGowen, Francesc Campoy, and Kathy Kam)  developed for the Google Cloud Platform Next event series. <br /> <br /> The demo, consists of 19 Nexus 6 cameras were placed around a  half-circle pointing inwards to take a picture of the subject at the  same moment in time, to create a 180 degree animated GIF - see them at  @googlecloudspin twitter!<br /> <br /> But wait, the Android cameras introduces some unknown delays when taking  a photo - how did we make all the cameras take pictures at the same  time?  What did we use to process and stitch the photos together?  And  most importantly, how did we pull it off in a matter of 3 weeks?<br /> <br /> Join this session to learn more about what we did behind the scenes, and  how we leveraged open source technology, Google Cloud Platform, and  Firebase to help us develop the demo rapidly.","category":"Develop","startDate":"08/27/2015 11:00AM","endDate":"08/27/2015 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25860,"name":"Bret McGowen &amp; Ray Tsang","profile":"Bret and Ray are Developer Advocates for the Google Cloud Platform in New York who actually worked on the @googlecloudspin project for the Google Cloud Platform Next event series.<br />\r\n<br />\r\nFollow them on Twitter: @bretmcg and @saturnism","avatarKey":"","userCode":"35b4","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25816,"name":"Kotlin: New Hope in a Java 6 Wasteland","description":"Java 8 was released last year adding lambdas, streams, and many  other language improvements. Java 9 is already in the works, but with  over half of Android devices stuck using Java 6 will we ever get to use a  modern language? <br /> <br /> Introducing Kotlin: a statically typed JVM language backed by JetBrains.  With features like lambdas, class extensions, and null-safety, it aims  to be concise, expressive, and highly interoperable. In this  presentation we will learn how powerful Kotlin can be when added to your  Android tool belt.","category":"Develop","startDate":"08/27/2015 11:50AM","endDate":"08/27/2015 12:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":8502,"name":"Michael Pardo","profile":"","avatarKey":"http://pbs.twimg.com/profile_images/476204454392627200/n37mQDnl.jpeg","userCode":"7777","company":"Notion AI","twitter":null,"linkedIn":null,"website":"www.notion.ai","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25818,"name":"Mobile Payments Opportunities for Android Developers","description":"Mobile Payments is one of the most exciting and constantly evolving  spaces right now and as Android developers we have a wide array of  opportunities. Apple Pay helped make contactless payments mainstream and  from now on it's going to be an exciting race to see how this landscape  evolves. Starting with Android 4.4, developers have the ability to send  contactless payments over Near Field Communication (NFC) using Host  Card Emulation (HCE). Learn how to make contactless payments work in a  mobile wallet implementation and the challenges associated with it. This  will include code samples, hands on demonstrations and lessons learned.","category":"Business","startDate":"08/27/2015 01:30PM","endDate":"08/27/2015 02:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":26102,"name":"Sam Edwards","profile":"","avatarKey":"http://static.sched.org/a6/2148286/avatar.jpg.320x320px.jpg?d7a","userCode":"487c","company":"Capital One","twitter":null,"linkedIn":null,"website":"http://handstandsam.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24384,"name":"Why, Hello There, Camera 2 API","description":"One of the many new features in Lollipop, Camera 2 is a new API for image and video capture and processing. For developers, Camera 2 presents both a vastly improved, better structured API for development and an opportunity to create more sophisticated and professional image and video applications.<br /><br />In this talk we will discuss the transition from the first Camera API to Camera API 2, look at how Camera 2's pipeline works, run through an example of setting up a camera and capturing images, and talk about the new data and capabilities that can be leveraged to build fully featured camera applications.","category":"Develop","startDate":"08/27/2015 02:20PM","endDate":"08/27/2015 03:00PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":5687,"name":"Huyen Dao","profile":"Huyen Tue Dao is a developer specializing in native Android and iOS development.  She graduated with a BS and MS in Computer and Electrical Engineering from the University of Maryland, College Park and has been developing for Android since 2010. The only other thing that keeps her up as late as development (and often longer) is gaming: PC, console, board, card, anything.","avatarKey":"http://static.sched.org/a6/1356594/avatar.jpg.320x320px.jpg?c91","userCode":"84e4","company":"Randomly Typing","twitter":null,"linkedIn":null,"website":"randomlytyping.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":26601,"name":"Monetizing Free-to-Play: Finding the Right Balance between In-App Purchases vs. Ads","description":"In-app purchases comprise a large share of in-game revenue today but are driven by paying power users (a.k.a &lsquo;whales&rsquo;) which typically make up less than five percent of the total user base. Ads can supplement monetization for the remaining ninety-five percent of non-paying users, but concerns around cannibalization and user experience for the whales prevents developers from implementing ads. As the gaming industry moves toward a hybrid of monetization models, targeting users across platforms becomes key. How do you show the right screen to the right user at the right time?","category":"Business","startDate":"08/27/2015 03:30PM","endDate":"08/27/2015 04:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":26650,"name":"Naman Goel","profile":"Naman Goel, Mobile Evangelist, Google<br /><br />Naman joined Google in 2013, currently working to help developers maximize mobile apps potential. He also works closely with the AdMob team focusing on mobile monetization. Prior to his time at Google, Naman worked at Goldman Sachs in the Equities Trading Technology Division for five years. He holds an MS in Computer Science from Arizona State University.","avatarKey":"http://static.sched.org/a6/2171013/avatar.jpg.320x320px.jpg?729","userCode":"030f","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25811,"name":"Forks, Fragmentation, and the Future of Android","description":"Android is the most popular mobile operating system on the planet. It  powers more than 80% of smartphones worldwide and shipped on over 1  billion devices in 2014. However, the hidden story here is that Android  forks now account for over 20% of the global Android ecosystem and 41%  of new devices shipped. Early on &ldquo;fragmentation&rdquo; was an issue of screen  size, display density, and platform version. The new &ldquo;fragmentation&rdquo; is  forked versions of the OS and alternate app stores. In this session we  will begin by looking at the Android Open Source Project (AOSP) and how  it helps shape the current development environment. We will explore  popular forks of Android including Cyanogen, FireOS (Amazon), MIUI  (Xiaomi), and others. We will also examine the role of Google Play  Services (Google&rsquo;s fork of Android). Finally we will evaluate the  opportunities that alternate app stores present and discuss strategies  for developers who wish to reach a wider audience with their  applications.","category":"Develop","startDate":"08/27/2015 05:10PM","endDate":"08/27/2015 05:50PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":25856,"name":"Chuck Greb","profile":"Location and maps. Open source and unit testing. Also Kotlin.","avatarKey":"http://static.sched.org/a6/2148014/avatar.jpg?ea9","userCode":"51da","company":"Mapzen","twitter":null,"linkedIn":null,"website":"https://mapzen.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24376,"name":"Monetizing apps on the Play Store: Integrating In-app Billing in your Android App","description":"Thinking about monetizing your app on the Play Store but not sure where to start? Android documentation driving you crazy? This talk pieces together all the information in one place and will take you through all the steps required to implement an in-app billing solution on Android for multiple product types.<br /><br />\r\n<p>There are two kinds of payments available to developers: One time payments and Recurring payments. At the end of this talk, you will learn how to</p>\r\n<ul>\r\n<li>\r\n<p>set up the payment workflow on Google Play Developer Console and your app</p>\r\n</li>\r\n<li>\r\n<p>integrate in-app billing files</p>\r\n</li>\r\n<li>\r\n<p>test the workflow for both one-time and recurring payments</p>\r\n</li>\r\n<li>manage the backend using Google Play Developer Api</li>\r\n</ul>\r\n<br />","category":"Develop","startDate":"08/27/2015 04:20PM","endDate":"08/27/2015 05:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":28200,"name":"Yash Prabhu","profile":"Yash Prabhu is a Senior Software Engineer and Android Team Lead at DramaFever who has been developing Android apps since 2010. She has given talks at Android Alliance Philadelphia, Girl Develop it Philly and AnDevCon Boston 2015. In her spare time, she volunteers at Girl Develop It Philly and Code For Philly as a mentor and teaching assistant and helps run study groups in Java. Yash has a Computer Science Masters degree from University of Pennsylvania.","avatarKey":"http://static.sched.org/a6/1410886/avatar.jpg.320x320px.jpg?6f3","userCode":"da18","company":"DramaFever","twitter":null,"linkedIn":null,"website":"yprabhu.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24368,"name":"Fearless Internationalization and Localization Across the Nations","description":"Many people are intimidated by localization (l10n) and internationalization (i18n) but they don&rsquo;t have to be&mdash;Android provides many tools out of the box to aide you in global domination. Learn how to provide alternate resources for different locales, how to be flexible in your layout design, and what to do when the built-in tools aren&rsquo;t quite enough, like defining custom date formats. We will also cover a Gradle integration with Smartling, a paid service, which allows updating translations to be as easy as a push and a pull.","category":"Develop","startDate":"08/27/2015 06:00PM","endDate":"08/27/2015 06:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":15758,"name":"Siena Aguayo","profile":"Siena is a mobile software engineer at Indiegogo in San Francisco, where she has developed apps on iOS, Android, and Rails/Angular. A Los Angeles native and Pokémon master, Siena began her career as a software engineer by attending Hackbright Academy, a programming bootcamp for women in San Francisco. In addition to building Android apps, Siena enjoys playing video games, knitting, jamming on the guitar, and studying Japanese. You can find her on Twitter @sienatime.","avatarKey":"http://static.sched.org/a6/1416787/avatar.jpg.320x320px.jpg?2f4","userCode":"1980","company":"Indiegogo","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25801,"name":"Adding a new ingredient to Location-Based AR","description":"Augmented Reality is a popular technique that developers have been using  to show extra information on top of the real-world view using mobile  devices, i'm sure you've seen apps where you point the camera at a  market and 3D image pops out, this its what this is about.<br /> <br /> In this session i will show you the basics of AR, how to integrate it in  your projects and how to add ibeacons to the equation using open  sourced libraries.","category":"Develop","startDate":"08/28/2015 10:10AM","endDate":"08/28/2015 10:50AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5667,"name":"Noe Branagan","profile":"Mobile developer since 2010, passionate about teaching and speaking, active contributor to the developer community in Santo Domingo as organizer, likes to collaborate with anything related with developers. Serves as a mentor/coach for events like startup weekends or hackathons. Co-founder of META is a non-profit organization with the objective to help the local dev community, code review for Udacity and Currently lead developer and the main Android developer at Orange R&D skill center where they focus in B2B Apps.","avatarKey":"http://static.sched.org/a6/1375071/avatar.jpg.320x320px.jpg?428","userCode":"3cd8","company":"Orange","twitter":null,"linkedIn":null,"website":"https://plus.google.com/+NoeBranagan","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25825,"name":"Tools of the Trade","description":"This talk will tour one of the most understated resources in the Android developer arsenal: the support tools.<br /> <br /> Learn how to enrich your methods and classes using annotations, so that  Lint and Android Studio will be able to spot errors for you. Or use  IntelliJ annotations to define contracts, and let the IDE warn you of  potential issues before you even run your code once. Take advantage of  the tools namespace to bend even the most cryptic XML resource to your  will.","category":"Develop","startDate":"08/28/2015 11:00AM","endDate":"08/28/2015 11:40AM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25867,"name":"Sebastiano Poggi","profile":"Emerging from the foggy plains of northern Italy, where he left his job at a wearables startup, Sebastiano moved to London aiming to put his curls at the service of great Android apps. Regularly speaking at conferences and blogging got him into the Google Developer Expert programme in 2014. Now he spends his time obsessing over UI and UX details while coding some rather cool apps at Novoda.","avatarKey":"http://static.sched.org/a6/2148010/avatar.jpg.320x320px.jpg?0c0","userCode":"6496","company":"Novoda","twitter":"@seebrock3r","linkedIn":null,"website":"https://about.me/sebastiano.poggi","email":null,"phone":"","phoneticName":"","gPlus":"+SebastianoPoggi","nickname":"rock3r","coverKey":"24d1d04a-4aba-40cd-b001-647b6433d0b9_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":24382,"name":"Voice Actions & Interaction API: Ubiquitous & Hands-Free Interfaces for Android.","description":"Voice actions enable users to interact with mobile apps using natural speech patterns, enabling hands-free behaviors in situations where the user is multi-tasking or otherwise occupied. Consistent support for voice actions across Android devices (phones, tablets, Wear) makes them a perfect enabler for ubiquitous computing experiences where actions are auto-magically handled by the right app, in the right context, across all devices potentially owned by that user. <br /><br /> While voice actions focus simply on triggering the relevant app, the Voice Interaction API (announced in Android M Preview) allows the app to engage with the user in a follow-up dialog to further clarify actions (e.g., confirmation) or narrow it down (e.g., select from alternatives). <br /><br /> In this talk we&rsquo;ll look at support for Voice Actions and the Voice Interaction API in Android, explore different usage contexts and walk through code snippets that show how we can leverage them in our own applications","category":"Develop","startDate":"08/28/2015 11:50AM","endDate":"08/28/2015 12:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":14854,"name":"Nitya Narasimhan","profile":"Nitya is a software professional with over 15+ years R&amp;D experience in industry, startups and academia. She spent over a decade at Motorola Labs working on advanced concepts for next-generation phone and television platforms, and currently balances consulting with early-stage technology development for mobile and web domains.<br /><br />She co-organizes the Google Developer Group chapters in New York City and Hudson Valley, and recently facilitated a successful 3-month Android Study Jam that taught a &lsquo;beginner&rsquo; cohort of students and professionals to develop a non-trivial Android application.","avatarKey":"http://static.sched.org/a6/1416559/avatar.jpg.320x320px.jpg?ce7","userCode":"04ac","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25802,"name":"An Intro to VR with Cardboard and Tango","description":"If you're new to VR, a detailed overview of the basics will get you up  to speed along with a tutorial and code walkthrough featuring the latest  Cardboard APIs as well as the Project Tango APIs which will enable real  time positional tracking using depth maps. We will also review the  different types of controller inputs and how to integrate and support  IoT devices with VR.","category":"Develop","startDate":"08/28/2015 01:30PM","endDate":"08/28/2015 02:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5664,"name":"Dario Laverde","profile":"Dario Laverde is a senior developer evangelist at HTC. He has experience in software development for mobile, embedded, Web and enterprise. Among his various professional roles, he has worked as an Android instructor, consultant, Java architect, author and entrepreneur. Dario leads the NYC-GDG (Google Developer Group), the NYCJava JUG, and co-organizes the New York Android Developers Meetup. He also runs the New York City based skylight1 open-source Android projects group that is currently working on Android Wear and Google Glass projects.","avatarKey":"http://static.sched.org/a4/1356606/avatar.jpg.320x320px.jpg?a71","userCode":"75af","company":"HTC","twitter":null,"linkedIn":null,"website":"http://htcdev.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24369,"name":"Game Basics: Animations with SurfaceView ","description":"<p>Do you want to learn how to make Android games? Should you use Animations API, SurfaceView or OpenGL? Come learn from the experts who have been making interactive educational games for the past few years. This talk focuses on game animation - how to create robust animations by customizing SurfaceView:</p>\r\n<p>* Continuous rendering on separate thread</p>\r\n<p>* Update state, render using state, repeat till done</p>\r\n<p>* Handling user input with SurfaceView</p>\r\n<p>* How to build animations such as rocket burst and page flip</p>\r\n<p>* Supporting multiple screen sizes and aspect ratios</p>\r\n<p>Throughout the talk we will discuss problems we encountered and lessons we learnt. By the end of the talk you should understand the basics of game-making with animation.</p>","category":"Develop","startDate":"08/28/2015 02:20PM","endDate":"08/28/2015 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":26101,"name":"Ana Redmond","profile":"Ana Redmond is the founder of Infinut, building math, science and learning to read games for kids on the Android platform. Her educational apps have been downloaded more than 1 million times. Ana is a software developer and consultant coding professionally in Java for more than 15 years. She is adjunct faculty at University of Washington teaching Java, Server Development, and Android courses to professionals. She is co-organizer of GDG Seattle.","avatarKey":"http://static.sched.org/a6/2124594/avatar.jpg.320x320px.jpg?a41","userCode":"da12","company":"Infinut","twitter":null,"linkedIn":null,"website":"http://www.infinut.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24356,"name":"Android Metaprogramming","description":"Do you like clean, dry, reusable code? Sure, we all do. For some use cases the cleanest and most efficient way to build and maintain a feature is to get meta. Are you ready to level up your developer skills? Metaprogramming is working with code that works with your code. Aspects, annotations, bytecode manipulation, runtime wizardry. What is possible? What unique limitations and opportunities exist when working within Android code? This will be a practical guide to Android metaprogramming from a cross-platform native SDK and app developer.","category":"Develop","startDate":"08/28/2015 03:30PM","endDate":"08/28/2015 04:10PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24404,"name":"Audrey Troutt","profile":"Audrey Troutt is the new director of mobile development at SnipSnap. Previously Audrey lead Android and iOS SDK development at Artisan Mobile in Philadelphia. In addition to being a polyglot programmer and full-stack developer with seven years experience, Audrey is passionate about clean code, beautiful apps, automation and vibrant communities.","avatarKey":"http://static.sched.org/a6/2124588/avatar.jpg.320x320px.jpg?915","userCode":"a53f","company":"SnipSnap","twitter":null,"linkedIn":null,"website":"http://audreytroutt.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25813,"name":"Getting on TV: Mobile Apps for Chromecast","description":"The Chromecast SDK offers a great opportunity to build apps for your TV. <br /> <br /> In this session we explore how to get started with chromecast,  understand it's architecture and how to build chromecast sender and  receiver apps.","category":"Develop","startDate":"08/28/2015 04:20PM","endDate":"08/28/2015 05:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25859,"name":"Somya Jain","profile":"Making apps for mobile, wearables and Smart TV.","avatarKey":"http://static.sched.org/a6/2130926/avatar.jpg.320x320px.jpg?874","userCode":"93c8","company":"SWARM","twitter":null,"linkedIn":null,"website":"http://www.swarmnyc.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":29700,"name":"Code Lab","description":null,"mapImageUrl":null,"events":[{"id":29500,"name":"Feedback Prototyping: the fastest way to an MVP","description":"You&rsquo;ve got an app idea, a few jars of cold-brew and a weekend to build your MVP. How do you stay focused on the idea and not the implementation details? How do you put a prototype in users&rsquo; hands early, so you can avoid over-investing in bad designs?&nbsp;<br /><br />In this active coding session, you&rsquo;ll learn how Cordova prototypes can keep your team focused on meaningful questions during the concept &amp; design phase. You&rsquo;ll learn how to:<br /><br />1.\tConfigure your dev environment for speed<br />2.\tIterate on your app&rsquo;s UI and logic quickly without breaking !@#$<br />3.\tMake it look good &ndash; so good &ndash; using Material design patterns&nbsp;<br />4.\tBeta test your app on user&rsquo;s personal device","category":"Develop","startDate":"08/27/2015 03:30PM","endDate":"08/27/2015 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":29550,"name":"Jordan Matthiesen","profile":"","avatarKey":"http://static.sched.org/a6/2207999/avatar.jpg.320x320px.jpg?c71","userCode":"2f90","company":"Microsoft","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":29501,"name":"Android M Runtime Permissions","description":"Android M adds a long-awaited feature: user-managed permissions. While some Android permissions you request will be granted to you at install time, others will require you to specifically ask the user at runtime. The user can not only reject your request then, but she can change her mind and revoke the permission at any time in the future.<br /><br />In this code lab, we will walk through how adjust your app to take the runtime permission model into account: when to ask for permission, how to determine if you have permission, how to gracefully degrade when the answer is \"no\", and so on. Attendees can follow along and modify the same sample project that the presenter will use for demonstrations, or attendees can experiment with their own code. Steps in the code lab will include:<br /><br />- Converting a traditional Android project to be able to build with the M Developer Preview<br /><br />- Detecting if you have all of your requested runtime permissions<br /><br />- Asking the user for those runtime permissions when needed, including explaining why you need them<br /><br />- Indicating to the user what portions of your UI still need permissions<br /><br />- Testing relevant scenarios, including handling the user revoking already-granted permissions<br /><br /><em>If you wish to participate in the hands-on work, you will need a copy of Android Studio and the M Developer Preview (version 2) installed on your notebook. You will also need to be hooked up to the conference WiFi or otherwise have Internet access.</em>","category":"Develop","startDate":"08/28/2015 11:00AM","endDate":"08/28/2015 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":5671,"name":"Mark Murphy","profile":"Mark Murphy is the founder of CommonsWare and the author of The Busy Coder’s Guide to Android Development. He is active in supporting the Android developer community, from answering questions on StackOverflow to publishing sample code and reusable components as open source.","avatarKey":"http://static.sched.org/a3/1049029/avatar.jpg.320x320px.jpg?bae","userCode":"d568","company":"CommonsWare, LLC","twitter":null,"linkedIn":null,"website":"http://commonsware.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":29502,"name":"Building an awesome Android app with Firebase","description":"In this lab we'll build a complete, collaborative app for Android. By using Firebase as the backend for our app, you can do this for free without spinning up our own server.&nbsp;<br /><br />Frank will live-code the example on-screen as you follow along with the written, step-by-step tutorial.&nbsp;<br /><br />Google engineers will also be available to help you with problems you may encounter and to answer your questions<br /><br /><em>Requirements: Android Studio</em>","category":"Develop","startDate":"08/28/2015 02:20PM","endDate":"08/28/2015 03:00PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":29551,"name":"Frank van Puffelen","profile":"Frank is an engineer for Firebase at Google. He helps developers build extraordinary apps that use Firebase as their back-end. If you've ever asked a Firebase question on StackOverflow, you've probably met Frank already.","avatarKey":"http://static.sched.org/a6/2207991/avatar.jpg.320x320px.jpg?1fd","userCode":"0639","company":"Google","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":29503,"name":"A simple SDK for creating and understanding app growth.","description":"You have spent months building an awesome mobile app and now it's finally live. But how can you grow your user base? This class will walk you through building a simple sharing feature from scratch in minutes. With the help of use cases, we will also go through tips for improving your existing app invites, referrals and sharing features to help boost your app virality and grow your user base.<br /><br /><em>Requirements: Android Studio&nbsp;</em>","category":"Develop","startDate":"08/28/2015 03:30PM","endDate":"08/28/2015 04:10PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28202,"name":"Evan Groth","profile":"A recovering hacker, Evan has been programming from day one. Evan built the ClassOwl app from blank screen to market in two short months. Evan recently joined Branch Metrics as a member of their evangelist team after building up his Android skills over several years, successfully launching TweetDreams and Excambio Android apps on the Google Play store.","avatarKey":"http://static.sched.org/a6/2199363/avatar.jpg.320x320px.jpg?c27","userCode":"2b0e","company":"Branch Metrics","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]}]},{"id":26901,"name":"Downtown","description":null,"mapImageUrl":null,"events":[{"id":24371,"name":"Making Sense of the Touch System","description":"Touch is pretty simple, right? You set an onClickListener and you are all set! But then... what happens when you want to drag stuff? What happens when you want to add gestures? How do you manage multiple views fighting for the focus? What is this pointer index thing? How do you animate a view after a fling and keep it natural? What is a touch slop?<br /><br />In this talk, we will take a good look at what happens under the hood when your fingers touch the screen and how you can use this to create interesting ways to interact with your app!","category":"Develop","startDate":"08/27/2015 02:20PM","endDate":"08/27/2015 03:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24405,"name":"Philippe Breault","profile":"Philippe is a software engineer at Mirego and has been passionate about android since 2010.He worked on a wide variety of Android apps for newspapers, startups, television providers and more.He is a GDE (Google Developer Expert), one of the organizers of droidcon Montréal and is very active in the Montréal Android Community.Philippe is also the author of the ADB IDEA plugin for Android studio.","avatarKey":"http://static.sched.org/a6/2124577/avatar.jpg.320x320px.jpg?db4","userCode":"419e","company":"Mirego","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25824,"name":"Think Like an Animator","description":"https://www.youtube.com/watch?v=qQV1TQcrzZE<br /> <br /> Material design offers a breadth of tools and paradigms to help us build  beautifully animated applications. But few of us have actually been  trained in the art of animation. Without a common animation language to  express your ideas, priority on these details can fall to the wayside.  That potentially means more confusion and less engagement among your  users.<br /> <br /> The solution: Android engineers need to become animators. We cover basic  principles of Animation, how these can be applied to the Android  platform, and how to work with designers (or on your own) to mock them  up.","category":"Design","startDate":"08/27/2015 11:00AM","endDate":"08/27/2015 11:40AM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":26350,"name":"Zack Sultan","profile":"","avatarKey":"http://static.sched.org/a6/2156955/avatar.jpg.320x320px.jpg?c18","userCode":"fa8e","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false},{"id":5651,"name":"Kevin Grant","profile":"Kevin Grant is an Android Engineer at tumblr, a creative blogging platform in New York City, where he focuses on application design, implementing the latest design and user interaction paradigms and pushing the boundaries of the Android framework.&nbsp;<br /><br />He began developing for Android in 2009, performing research at the University of Nevada, Reno. After graduating he moved to Malm&ouml;, Sweden where he took part in the Scandinavian startup scene.","avatarKey":"http://static.sched.org/a4/1356579/avatar.jpg.320x320px.jpg?63d","userCode":"f760","company":"Tumblr","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25817,"name":"Material design everywhere using the Android Support Libraries","description":"Android 5.0 was one of the more exciting releases ever - especially with  the introduction of the Material design.  The specifications describe a  beautiful UI, that can be a challenging for developers to implement,  particularly if they must support backwards compatibility.<br /> <br /> It just became easier with the release of the 'Android Design Support  Library' (and the previously released 'AppCompat Library').  Developers  now have the tools that make it simple to create Material compliant apps  - that will work and look great on almost all devices (even ones  running 2.1).<br /> <br /> In this presentation I will highlight some important components of these  libraries, and demonstrate how to use them effectively. <br /> <br /> It is just the beginning for Material design - come learn about the  important tools that make it easy to be part of the revolution.","category":"Design","startDate":"08/27/2015 10:10AM","endDate":"08/27/2015 10:50AM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25861,"name":"Mike Wolfson","profile":"Mike is a passionate mobile designer/developer working out of Phoenix. He has been working in the software field for more than 20 years, and with Android since its introduction. Currently, he develops Android applications for an IoT startup, in the automotive and payments space. He is a Google Developer Expert in Android, and the author of the book “Android Developer Tools Essentials” published by O’Reilly.Mike has spoken about Android and mobile development at a variety of conferences and user groups (including Oscon, AnDevCon, GDGSv, Droidcon Turin, and others). When he is not geeking out about phones, he enjoys the outdoors (snowboarding, hiking, scuba diving), collecting PEZ dispensers, and chasing his young (but quick) daughter.","avatarKey":"http://static.sched.org/a6/1652750/avatar.jpg.320x320px.jpg?68c","userCode":"f3b7","company":"Able Android LLC","twitter":null,"linkedIn":null,"website":"http://www.mikewolfson.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25826,"name":"Vector All The Things","description":"VectorDrawable was a hugely important introduction in Lollipop and could  be available to those who cannot minSdkVersion=\"21\" if/when the compat  library is released.<br /> <br /> Mark Allison, GDE for Android, writer of https://blog.stylingandroid.com  will provide an overview of VectorDrawable and provide some easy to  understand examples of how powerful they can be.<br /> <br /> This talk will be aimed at experienced Android developers but will be understandable to those who are unfamiliar with SVG.","category":"Design","startDate":"08/27/2015 11:50AM","endDate":"08/27/2015 12:30PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25868,"name":"Mark Allison","profile":"I'm the author of https://blog.stylingandroid.com, GDE for Android, and Android dev.<br />\r\n<br />\r\nI'm passionate about engineering user delight and all things UI / UX.<br />\r\n<br />\r\nI see IoT technologies as hugely important  over the next few years - the possibilities are mind-blowing.<br />\r\n<br />\r\nI love scotch malt whisky. Give me whisky and you'll be a friend for life!<br />\r\n<br />\r\nI will be brining a limited supply of Styling Android pins to Droidcon NYC Anyone who asks nicely (or even asks horribly) will get one*.<br />\r\n<br />\r\n* while stocks last","avatarKey":"http://static.sched.org/a6/2147991/avatar.jpg.320x320px.jpg?d57","userCode":"02d2","company":"Styling Android Limited","twitter":null,"linkedIn":null,"website":"https://blog.stylingandroid.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24372,"name":"Mastering RecyclerView Layouts","description":"RecyclerView is a popular new item among developers for the flexibility that it provides in displaying collection views. At the heart of this flexible new API lies the ability for the developer to define that placement of child views in the collection using an external layout manager. Google has provided a good number of built-in managers for simple cases, but what if you want to go beyond that?<br /><br />In this session we will explore the features of layout managers provided by the framework for displaying items in lists and grids. We will then dive into the API for building your own layout manager to gain full control over how RecyclerView displays views for your collection.","category":"Develop","startDate":"08/27/2015 01:30PM","endDate":"08/27/2015 02:10PM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":24417,"name":"Dave Smith","profile":"Dave Smith is the Android Lead at NewCircle, where he focuses on development and maintenance of courseware materials—training developers on all levels of the Android stack. Over the past six years, he has developed applications and embedded the Android platform into devices for the entertainment industry and testing laboratories.","avatarKey":"http://static.sched.org/a6/2124584/avatar.jpg.320x320px.jpg?ea8","userCode":"1824","company":"NewCircle","twitter":null,"linkedIn":null,"website":"http://milehighandroid.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25829,"name":"Your Brand in a Material World","description":"In 2014, Google unveiled its bold, colorful plan to make unified  interfaces a reality for web and mobile platforms. Material design,  founded on the principle that interface elements should behave as  predictably as physical objects, has been well-received by designers and  adopted faster than any of Google's previous guidelines.<br /> <br /> But even as developers and designers adopt and evangelize the new design  language, there's still the nagging question of just how branding fits  into the picture. Designing for the user while keeping your brand in  focus is more important than ever, so how can brands strike the right  balance?<br /> <br /> This talk will unpack the question of branding in material design,  examining current practices, what it means to \"go material\" and how to  effectively and appropriately brand your product while fostering a  cohesive, delightful user experience.","category":"Design","startDate":"08/27/2015 03:30PM","endDate":"08/27/2015 04:10PM","publicEvent":true,"rsvpCount":3,"speakers":[{"id":25871,"name":"Liam Spradlin","profile":"I'm Liam Spradlin, a visual designer working on the web, iOS, and Android. In the past few years I've worked in both agency and freelance contexts with clients including GE Appliance, the National MS Society, and a number of independent developers with apps like Nova Launcher, AllCast, and Today Calendar, creating compelling interfaces, experiences, print layouts, and visual assets. My approach with any design, whether it's a brand new product yet to be shaped, or an existing one with millions of users, is to figure out the essentials - what does it do? What does the audience expect? How can we best facilitate the former and satisfy the latter? I like to explore areas where designs can delight their audiences in invisible ways, and I think there are tons of these opportunities in modern design, especially on mobile devices. My main hobby is also my work - whether it's typography, interface, or illustration, most of my free time is spent designing. Outside of that, I'm a freelance photographer (most recently shooting the Kentucky Derby for Churchill Downs), a writer, and - occasionally - a glass blower.","avatarKey":"http://static.sched.org/a6/2148006/avatar.jpg.320x320px.jpg?c5e","userCode":"5d42","company":"touchlab","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25822,"name":"TextView how to turn design into reality for multiple languages","description":"The TextView seems to be a fairly innocent and easy to use widget when  building out UI for Android. However, when your app is targeting  multiple locales, changing things like line spacing and line spacing  multiplier can cause major issues. Join me as we talk through how text  is rendered on a screen to some common pitfalls of developing with the  TextView in multiple languages.","category":"Develop","startDate":"08/27/2015 04:20PM","endDate":"08/27/2015 05:00PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25865,"name":"Elliott Chenger","profile":"Elliott Chenger is an Android Engineer currently at Under Armour Connected Fitness in Austin Texas. Previously he was at Mutual Mobile, a digital agency also developing for Android. He organizes the Wearable ATX meetup and speaks at numerous local developer groups including Google Developer Group. He also blogs semi-regularly at omitneedlesscode.com","avatarKey":"http://static.sched.org/a6/2148290/avatar.jpg.320x320px.jpg?385","userCode":"e4f2","company":"Under Armour","twitter":"echenger","linkedIn":null,"website":"omitneedlesscode.com","email":null,"phone":"","phoneticName":"","gPlus":"","nickname":"","coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25830,"name":"Using Styles and Themes Without Going Crazy","description":"Styles and themes are a core part of the Android system. That said: they can be rather difficult to use. Setting up styles improperly can hurt more than it can help, and there have been plenty of sleepless nights caused by theming woes.  <br /><br />This talk will present a system for using styles and themes without going crazy.","category":"Design","startDate":"08/27/2015 05:10PM","endDate":"08/27/2015 05:50PM","publicEvent":true,"rsvpCount":5,"speakers":[{"id":25872,"name":"Dan Lew","profile":"I've been an Android developer for almost six years. I started at Mobiata (FlightTrack), went on to lead the Android team at Expedia, and am currently working at Trello. I'm an Android Google Developer Expert and have been giving talks at local meetups and conferences for the last several years. I've released a couple minor open source Android libraries and several open source apps on Github (<a href=\"http://github.com/dlew\" target=\"_blank\">http://github.com/dlew</a>). I also write regularly about Android development (<a href=\"http://blog.danlew.net/\" target=\"_blank\">http://blog.danlew.net/</a>).","avatarKey":"http://static.sched.org/a6/2124580/avatar.jpg.320x320px.jpg?804","userCode":"4c73","company":"Trello","twitter":null,"linkedIn":null,"website":"http://danlew.net","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24358,"name":"Beautiful Typography on Android (or close enough)","description":"Material design's \"paper\" stresses the beautiful typography of print journalism -- but how? This talk will work directly through translating paper designs to Android's TextView, starting with styles, Spans, and Typefaces and finally diving deep into FontMetrics and custom text drawing. Forget about Roboto -- let's go down the rabbit hole.","category":"Design","startDate":"08/28/2015 10:10AM","endDate":"08/28/2015 10:50AM","publicEvent":true,"rsvpCount":4,"speakers":[{"id":24406,"name":"Lisa Wray","profile":"Lisa is currently a one-woman Android team at Genius, the world's largest repository of musical knowledge.  Previously, she was a mobile developer at the New York Times and a developer advocate for Android and wearables at Google.  She has a B.S. in Computer Science and Music from M.I.T.","avatarKey":"http://static.sched.org/a6/2124575/avatar.jpg.320x320px.jpg?cbe","userCode":"cda3","company":"Genius","twitter":null,"linkedIn":null,"website":"genius.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24354,"name":"Android Developer Options: What can those toggles do for me?","description":"Testing an app on your perfect Nexus 5 device under perfect network conditions works great, but you're getting reports of strange behavior from the wild and weird crashes that you can't reproduce. This talk will walk through some of the more complex options on the Developer Options screen in the Android OS and discuss how a developer can use them to debug problems in their application. Topics covered include: showing surface updates to help you find layout loops in your app, showing layout bounds to get your views pixel perfect, and aggressively killing processes and activities to ensure that your app performs well under stress. We'll cover these options and more as we dive deep into debugging apps.","category":"Develop","startDate":"08/28/2015 11:00AM","endDate":"08/28/2015 11:40AM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":24403,"name":"Andrea Falcone","profile":"Andrea Falcone is a senior software engineer at Twitter, working on the Beta by Crashlytics and the Fabric platform. She has developed for the Fabric and Crashlytics Android SDKs and tools (plugins for Ant, Maven, Gradle, IntelliJ, Android Studio and Eclipse!) as well as the Beta by Crashlytics Android app.","avatarKey":"http://static.sched.org/a6/2124589/avatar.jpg.320x320px.jpg?744","userCode":"a318","company":"Twitter/Fabric","twitter":null,"linkedIn":null,"website":"fabric.io","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25823,"name":"The Road to 60FPS","description":"When you notice FPS glitches in your app, how do you find and fix them?  This talk will discuss various options for measuring FPS, and some of  the work Facebook&rsquo;s Android Newsfeed team is doing to improve  interaction smoothness. This includes some of the automated solutions  Facebook uses to blame janky frames both in the wild and in automated  tests.&nbsp;","category":"Develop","startDate":"08/28/2015 11:50AM","endDate":"08/28/2015 12:30PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":25866,"name":"Jason Sendros","profile":"","avatarKey":"http://static.sched.org/a6/2148012/avatar.jpg.320x320px.jpg?68b","userCode":"07f2","company":"Facebook","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":25808,"name":"Animation to Guide Us All - How animations can improve the User Experience of your application ","description":"After the introduction of Material Design and Android Lollipop,  animations and great design finally got the attention they deserve. New  concepts have been introduced and finally a guideline exists. But  Material Design goes way further than just elevations, cards and  beautiful colors. Animations now are a big factor and play an important  role in applications, a role that is not only related to a wow factor,  but actually animations are a big friend of the User Experience of an  App. <br /> <br /> We will go through transition animations that helps the user understand  how your app works and how to guide him in the easiest way possible and  I'll show some do and donts of navigation and animation made by some  popular apps. We'll also talk some UX points so you can plan better how  the user will navigate through your app. After that, you will never  think about animation in the same way again!<br /> <br /> This talk is an evolution of my well received talk at Droidcon Montreal,  this time, following the request of many people, I'll have some example  codes and some application demos to show how to achieve some animations  in code.","category":"Design","startDate":"08/28/2015 01:30PM","endDate":"08/28/2015 02:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":5690,"name":"Marcos Paulo Damasceno","profile":"Marcos is an Android Craftsman at Mirego, one of Canada's fastest-growing companies.He loves simple and beautiful UX and UI and has his attention always focused to small details and what makes mobile apps great. A passionate about Start Ups, Marcos already attended to many start up weekends and hackathons in Sao Paulo, San Francisco and Montreal and currently serves as a mentor for some successful brazilian apps.He has been playing around with mobile since 2010, worked in many significant android apps for the brazilian market in the backend and mobile stack. Marcos already had the opportunity to speak at big conferences in Brazil like The Developer's Conference and DevFest Sao Paulo. Marcos moved to Montreal in 2013, where he led the development of a big consumer's product android tablet app currently used by Sony US and now do great stuff with an amazing team at Mirego.You can follow Marcos at:Google Plus +marcospaulosdTwitter @marcospaulosd","avatarKey":"http://static.sched.org/a6/1375294/avatar.jpg.320x320px.jpg?e0f","userCode":"e38c","company":"Mirego","twitter":null,"linkedIn":null,"website":"@marcospaulosd","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"83be3710-0906-441f-b0a4-94e8ab6f5015_cover","facebook":null,"emailPublic":false,"following":false}]},{"id":25819,"name":"Painless UI Testing","description":"What if you could get your UI tests to run as fast as your unit tests? <br /> <br /> - you would write more tests<br /> - you would feel happy writing the tests<br /> - your managers would be pleased with you not goofing around with that new testing framework around the corner<br /> <br /> Using patterns of yore (like Martin Fowler's supervising controller,  effective use of presenters and view model state) we're going to tackle  everyday-real-annoying impediments to UI testing. We'll address what  parts of the UI need testing and effective ways of testing them.<br /> <br /> The objective of the talk is to prove to the world that the title of this talk is not an oxymoron.","category":"Develop","startDate":"08/28/2015 03:30PM","endDate":"08/28/2015 04:10PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":25863,"name":"Kaushik Gopal","profile":"I work as the resident Android nerd for Wedding Party, a startup in the Bay Area. I'm in charge of our Android app right from the stages of translating designs to feature implementation.<br /><br />https://play.google.com/store/apps/details?id=com.micromobs.pkk<br /><br />I also co-host an Android developer podcast called \"Fragmented\".<br /><br /><a href=\"http://fragmentedpodcast.com/\" target=\"_blank\">http://fragmentedpodcast.com/</a>","avatarKey":"http://static.sched.org/a6/2147986/avatar.jpg.320x320px.jpg?e85","userCode":"cb60","company":"","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24362,"name":"Don’t Get Lost in Translation: Strategies for Serializing Data Structures","description":"The current solutions for mapping data to java objects come in many shapes and sizes, with JSON leading as the most familiar and &ldquo;coolest&rdquo; solution. Yes, JSON is very readable, convenient, and offers great support libraries like GSON and Jackson, but these options don&rsquo;t always get the job done.&nbsp;Accessing and parsing serialized data is a common source of runtime inefficiency within applications, and this delay can crush your app&rsquo;s overall user experience. How can you bypass this inefficiency? Google&rsquo;s FlatBuffer library is the answer. FlatBuffers are similar to Google&rsquo;s Protocol Buffers, but with one key differentiator: the ability to access serialized data without parsing or unpacking it first. Imagine a serialization process with no temporary objects, no additional allocation, and no copying. Join us for a deep dive into Google&rsquo;s FlatBuffers library to learn more about the advantages of using FlatBuffers and what makes it different from other commonly used libraries.","category":"Develop","startDate":"08/28/2015 04:20PM","endDate":"08/28/2015 05:00PM","publicEvent":true,"rsvpCount":1,"speakers":[{"id":24410,"name":"Christopher Brown","profile":"Chris Brown currently serves as Principle Mobile Engineer and Lead Developer for the priceline.com Android team. He started his career as a web application developer in Java and Adobe Flex, but quickly found himself drawn to mobile and Android development. <br />\r\n<br />\r\nThis year, Chris and his team launched the priceline.com companion app for Android Wear, and were recently awarded a Top Developer badge in Google Play.<br />\r\n<br />\r\nChris is also the Founder and Developer of kapturem, an app that allows you to gain notoriety in the kapturem community by sharing pictures, completing challenges, following friends, and more. In 2013, Chris built the Android Client Wrapper Library for the Dark Sky Forecast API.<br />\r\n<br />\r\nYou can find Chris in priceline.com's New York City office, listening to his Drake playlist on repeat and sporting a different Android T-shirt every day.","avatarKey":"http://static.sched.org/a6/2124597/avatar.jpg.320x320px.jpg?101","userCode":"220d","company":"priceline.com","twitter":null,"linkedIn":null,"website":"priceline.com","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":28351,"name":"Turning Your Mobile App into a Growth Engine.","description":"You have spent months building an awesome mobile app and now it's finally live. But how can you grow your user base? This class will walk you through building a simple sharing feature from scratch in minutes. With the help of use cases, we will also go through tips for improving your existing app invites, referrals and sharing features to help boost your app virality and grow your user base.","category":"Business","startDate":"08/28/2015 05:00PM","endDate":"08/28/2015 05:40PM","publicEvent":true,"rsvpCount":0,"speakers":[{"id":28202,"name":"Evan Groth","profile":"A recovering hacker, Evan has been programming from day one. Evan built the ClassOwl app from blank screen to market in two short months. Evan recently joined Branch Metrics as a member of their evangelist team after building up his Android skills over several years, successfully launching TweetDreams and Excambio Android apps on the Google Play store.","avatarKey":"http://static.sched.org/a6/2199363/avatar.jpg.320x320px.jpg?c27","userCode":"2b0e","company":"Branch Metrics","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":null,"facebook":null,"emailPublic":false,"following":false}]},{"id":24365,"name":"Debug Builds: A New Hope","description":"The Cash team at Square moves fast. Really fast. Learn about the tools that we use to eliminate external dependencies and move as fast as possible.  In this talk, I&rsquo;ll show you how to: <br /><br />&bull; Quickly verify all of the states of your app by eliminating the server. <br />&bull; Build and test a server-supported feature before the server is ready. <br />&bull; Add shortcuts to accelerate your edit-verify cycle. <br />&bull; Make it easy to submit bug reports with screenshots &amp; full context.","category":"Develop","startDate":"08/28/2015 02:20PM","endDate":"08/28/2015 03:00PM","publicEvent":true,"rsvpCount":2,"speakers":[{"id":14015,"name":"Matt Precious","profile":"Lead developer of Square Cash for Android. Contributor to several open source projects including Square's Wire.","avatarKey":"http://static.sched.org/a6/1414165/avatar.jpg.320x320px.jpg?62e","userCode":"ebac","company":"Square","twitter":null,"linkedIn":null,"website":"","email":null,"phone":null,"phoneticName":null,"gPlus":null,"nickname":null,"coverKey":"c1f6a123-56ba-463f-84a7-0a2bc6f6a04b_cover","facebook":null,"emailPublic":false,"following":false}]}]}],"blocks":[{"id":27501,"name":"Lunch","description":null,"startDate":"08/27/2015 12:30PM","endDate":"08/27/2015 01:30PM"},{"id":27503,"name":"Party","description":null,"startDate":"08/27/2015 07:00PM","endDate":"08/27/2015 10:00PM"},{"id":27504,"name":"Lunch","description":null,"startDate":"08/28/2015 12:30PM","endDate":"08/28/2015 01:30PM"}]}